; ModuleID = 'printtokens2_2_fuzz.c'
source_filename = "printtokens2_2_fuzz.c"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128"
target triple = "arm64-apple-macosx12.0.0"

@__stdoutp = external global ptr, align 8
@.str = private unnamed_addr constant [37 x i8] c"Error!,please give the token stream\0A\00", align 1, !dbg !0
@__stdinp = external global ptr, align 8
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [28 x i8] c"The file %s doesn't exists\0A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1, !dbg !17
@buffer = global [81 x i8] zeroinitializer, align 1, !dbg !22
@.str.4 = private unnamed_addr constant [13 x i8] c"error,\22%s\22.\0A\00", align 1, !dbg !29
@.str.5 = private unnamed_addr constant [15 x i8] c"keyword,\22%s\22.\0A\00", align 1, !dbg !34
@.str.6 = private unnamed_addr constant [18 x i8] c"identifier,\22%s\22.\0A\00", align 1, !dbg !39
@.str.7 = private unnamed_addr constant [13 x i8] c"numeric,%s.\0A\00", align 1, !dbg !44
@.str.8 = private unnamed_addr constant [12 x i8] c"string,%s.\0A\00", align 1, !dbg !46
@.str.9 = private unnamed_addr constant [17 x i8] c"character,\22%s\22.\0A\00", align 1, !dbg !51
@.str.10 = private unnamed_addr constant [6 x i8] c"eof.\0A\00", align 1, !dbg !56
@.str.11 = private unnamed_addr constant [4 x i8] c"and\00", align 1, !dbg !61

!80 = !DIGlobalVariableExpression(var: !81, expr: !DIExpression())
!81 = distinct !DIGlobalVariable(scope: null, file: !2, line: 327, type: !68, isLocal: true, isDefinition: true)
!82 = !DIGlobalVariableExpression(var: !83, expr: !DIExpression())
!83 = distinct !DIGlobalVariable(scope: null, file: !2, line: 427, type: !84, isLocal: true, isDefinition: true)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 25)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(scope: null, file: !2, line: 439, type: !9, isLocal: true, isDefinition: true)
!89 = !DIGlobalVariableExpression(var: !90, expr: !DIExpression())
!90 = distinct !DIGlobalVariable(scope: null, file: !2, line: 441, type: !63, isLocal: true, isDefinition: true)
!91 = !DIGlobalVariableExpression(var: !92, expr: !DIExpression())
!92 = distinct !DIGlobalVariable(scope: null, file: !2, line: 441, type: !93, isLocal: true, isDefinition: true)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 8)
!96 = !DIGlobalVariableExpression(var: !97, expr: !DIExpression())
!97 = distinct !DIGlobalVariable(scope: null, file: !2, line: 444, type: !9, isLocal: true, isDefinition: true)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(scope: null, file: !2, line: 446, type: !93, isLocal: true, isDefinition: true)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(scope: null, file: !2, line: 449, type: !9, isLocal: true, isDefinition: true)
!102 = !DIGlobalVariableExpression(var: !103, expr: !DIExpression())
!103 = distinct !DIGlobalVariable(scope: null, file: !2, line: 451, type: !104, isLocal: true, isDefinition: true)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 9)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(scope: null, file: !2, line: 454, type: !9, isLocal: true, isDefinition: true)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(scope: null, file: !2, line: 456, type: !104, isLocal: true, isDefinition: true)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(scope: null, file: !2, line: 459, type: !9, isLocal: true, isDefinition: true)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(scope: null, file: !2, line: 461, type: !77, isLocal: true, isDefinition: true)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(scope: null, file: !2, line: 464, type: !9, isLocal: true, isDefinition: true)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(scope: null, file: !2, line: 466, type: !93, isLocal: true, isDefinition: true)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(scope: null, file: !2, line: 470, type: !77, isLocal: true, isDefinition: true)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(scope: null, file: !2, line: 506, type: !9, isLocal: true, isDefinition: true)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 648, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 81)
!126 = !{i32 7, !"Dwarf Version", i32 4}
!127 = !{i32 2, !"Debug Info Version", i32 3}
!128 = !{i32 1, !"wchar_size", i32 4}
!129 = !{i32 7, !"PIC Level", i32 2}
!130 = !{i32 7, !"uwtable", i32 2}
!131 = !{i32 7, !"frame-pointer", i32 1}
!132 = !{!"Homebrew clang version 15.0.3"}
!133 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 23, type: !134, scopeLine: 26, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !138)
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !136, !137}
!136 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!138 = !{}
!139 = !DILocalVariable(name: "argc", arg: 1, scope: !133, file: !2, line: 24, type: !136)
!140 = !DILocation(line: 24, column: 5, scope: !133)
!141 = !DILocalVariable(name: "argv", arg: 2, scope: !133, file: !2, line: 25, type: !137)
!142 = !DILocation(line: 25, column: 7, scope: !133)
!143 = !DILocalVariable(name: "fname", scope: !133, file: !2, line: 26, type: !26)
!144 = !DILocation(line: 26, column: 10, scope: !133)
!145 = !DILocalVariable(name: "tok", scope: !133, file: !2, line: 27, type: !146)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "token", file: !147, line: 18, baseType: !26)
!147 = !DIFile(filename: "./tokens.h", directory: "XXX/converter/ft_data/source_code/printtokens2_2")
!148 = !DILocation(line: 27, column: 10, scope: !133)
!149 = !DILocalVariable(name: "tp", scope: !133, file: !2, line: 28, type: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "token_stream", file: !147, line: 16, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !153, line: 157, baseType: !154)
!153 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX12.sdk/usr/include/_stdio.h", directory: "")
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !153, line: 126, size: 1216, elements: !155)
!155 = !{!156, !159, !160, !161, !163, !164, !169, !170, !171, !175, !179, !189, !195, !196, !199, !200, !202, !204, !205, !206}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !154, file: !153, line: 127, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !154, file: !153, line: 128, baseType: !136, size: 32, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !154, file: !153, line: 129, baseType: !136, size: 32, offset: 96)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !154, file: !153, line: 130, baseType: !162, size: 16, offset: 128)
!162 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !154, file: !153, line: 131, baseType: !162, size: 16, offset: 144)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !154, file: !153, line: 132, baseType: !165, size: 128, offset: 192)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !153, line: 92, size: 128, elements: !166)
!166 = !{!167, !168}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !165, file: !153, line: 93, baseType: !157, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !165, file: !153, line: 94, baseType: !136, size: 32, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !154, file: !153, line: 133, baseType: !136, size: 32, offset: 320)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !154, file: !153, line: 136, baseType: !27, size: 64, offset: 384)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !154, file: !153, line: 137, baseType: !172, size: 64, offset: 448)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64)
!173 = !DISubroutineType(types: !174)
!174 = !{!136, !27}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !154, file: !153, line: 138, baseType: !176, size: 64, offset: 512)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64)
!177 = !DISubroutineType(types: !178)
!178 = !{!136, !27, !26, !136}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !154, file: !153, line: 139, baseType: !180, size: 64, offset: 576)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DISubroutineType(types: !182)
!182 = !{!183, !27, !183, !136}
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !153, line: 81, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !185, line: 71, baseType: !186)
!185 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX12.sdk/usr/include/sys/_types.h", directory: "")
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !187, line: 24, baseType: !188)
!187 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX12.sdk/usr/include/arm/_types.h", directory: "")
!188 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !154, file: !153, line: 140, baseType: !190, size: 64, offset: 640)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DISubroutineType(types: !192)
!192 = !{!136, !27, !193, !136}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !154, file: !153, line: 143, baseType: !165, size: 128, offset: 704)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !154, file: !153, line: 144, baseType: !197, size: 64, offset: 832)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !153, line: 98, flags: DIFlagFwdDecl)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !154, file: !153, line: 145, baseType: !136, size: 32, offset: 896)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !154, file: !153, line: 148, baseType: !201, size: 24, offset: 928)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 24, elements: !69)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !154, file: !153, line: 149, baseType: !203, size: 8, offset: 952)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 8, elements: !20)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !154, file: !153, line: 152, baseType: !165, size: 128, offset: 960)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !154, file: !153, line: 155, baseType: !136, size: 32, offset: 1088)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !154, file: !153, line: 156, baseType: !183, size: 64, offset: 1152)
!207 = !DILocation(line: 28, column: 17, scope: !133)
!208 = !DILocation(line: 29, column: 9, scope: !209)
!209 = distinct !DILexicalBlock(scope: !133, file: !2, line: 29, column: 9)
!210 = !DILocation(line: 29, column: 13, scope: !209)
!211 = !DILocation(line: 29, column: 9, scope: !133)
!212 = !DILocation(line: 31, column: 25, scope: !213)
!213 = distinct !DILexicalBlock(scope: !209, file: !2, line: 30, column: 8)
!214 = !DILocation(line: 31, column: 14, scope: !213)
!215 = !DILocation(line: 32, column: 10, scope: !213)
!216 = !DILocation(line: 32, column: 16, scope: !213)
!217 = !DILocation(line: 33, column: 8, scope: !213)
!218 = !DILocation(line: 34, column: 14, scope: !219)
!219 = distinct !DILexicalBlock(scope: !209, file: !2, line: 34, column: 14)
!220 = !DILocation(line: 34, column: 18, scope: !219)
!221 = !DILocation(line: 34, column: 14, scope: !209)
!222 = !DILocation(line: 35, column: 16, scope: !219)
!223 = !DILocation(line: 35, column: 14, scope: !219)
!224 = !DILocation(line: 35, column: 9, scope: !219)
!225 = !DILocation(line: 37, column: 18, scope: !226)
!226 = distinct !DILexicalBlock(scope: !219, file: !2, line: 37, column: 8)
!227 = !DILocation(line: 37, column: 10, scope: !226)
!228 = !DILocation(line: 38, column: 10, scope: !226)
!229 = !DILocation(line: 40, column: 18, scope: !133)
!230 = !DILocation(line: 40, column: 17, scope: !133)
!231 = !DILocation(line: 40, column: 12, scope: !133)
!232 = !DILocation(line: 40, column: 5, scope: !133)
!233 = !DILocation(line: 41, column: 26, scope: !133)
!234 = !DILocation(line: 41, column: 8, scope: !133)
!235 = !DILocation(line: 41, column: 7, scope: !133)
!236 = !DILocation(line: 42, column: 19, scope: !133)
!237 = !DILocation(line: 42, column: 9, scope: !133)
!238 = !DILocation(line: 42, column: 8, scope: !133)
!239 = !DILocation(line: 43, column: 5, scope: !133)
!240 = !DILocation(line: 43, column: 25, scope: !133)
!241 = !DILocation(line: 43, column: 12, scope: !133)
!242 = !DILocation(line: 43, column: 30, scope: !133)
!243 = !DILocation(line: 45, column: 20, scope: !244)
!244 = distinct !DILexicalBlock(scope: !133, file: !2, line: 44, column: 5)
!245 = !DILocation(line: 45, column: 8, scope: !244)
!246 = !DILocation(line: 46, column: 22, scope: !244)
!247 = !DILocation(line: 46, column: 12, scope: !244)
!248 = !DILocation(line: 46, column: 11, scope: !244)
!249 = distinct !{!249, !239, !250, !251}
!250 = !DILocation(line: 47, column: 5, scope: !133)
!251 = !{!"llvm.loop.mustprogress"}
!252 = !DILocation(line: 48, column: 17, scope: !133)
!253 = !DILocation(line: 48, column: 5, scope: !133)
!254 = !DILocation(line: 49, column: 5, scope: !133)
!255 = distinct !DISubprogram(name: "open_character_stream", scope: !2, file: !2, line: 62, type: !256, scopeLine: 64, spFlags: DISPFlagDefinition, unit: !24, retainedNodes: !138)
!256 = !DISubroutineType(types: !257)
!257 = !{!258, !26}
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "character_stream", file: !259, line: 10, baseType: !151)
!259 = !DIFile(filename: "./stream.h", directory: "XXX/converter/ft_data/source_code/printtokens2_2")
!260 = !DILocalVariable(name: "fname", arg: 1, scope: !255, file: !2, line: 63, type: !26)
!261 = !DILocation(line: 63, column: 7, scope: !255)
!262 = !DILocalVariable(name: "fp", scope: !255, file: !2, line: 64, type: !258)
!263 = !DILocation(line: 64, column: 20, scope: !255)
!264 = !DILocation(line: 65, column: 6, scope: !265)
!265 = distinct !DILexicalBlock(scope: !255, file: !2, line: 65, column: 6)
!266 = !DILocation(line: 65, column: 12, scope: !265)
!267 = !DILocation(line: 65, column: 6, scope: !255)
!268 = !DILocation(line: 66, column: 9, scope: !265)
!269 = !DILocation(line: 66, column: 8, scope: !265)
!270 = !DILocation(line: 66, column: 6, scope: !265)
!271 = !DILocation(line: 67, column: 22, scope: !272)
