; ModuleID = 'replace_fuzz.c'
source_filename = "replace_fuzz.c"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128"
target triple = "arm64-apple-macosx12.0.0"

@__stdinp = external global ptr, align 8
@__stdoutp = external global ptr, align 8
@.str = private unnamed_addr constant [25 x i8] c"in omatch: can't happen\0A\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [26 x i8] c"in patsize: can't happen\0A\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [3 x i8] c"rb\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [16 x i8] c"cant open file\0A\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [25 x i8] c"usage: change from [to]\0A\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [32 x i8] c"change: illegal \22from\22 pattern\0A\00", align 1, !dbg !29
@.str.7 = private unnamed_addr constant [29 x i8] c"change: illegal \22to\22 string\0A\00", align 1, !dbg !34
@.str.8 = private unnamed_addr constant [28 x i8] c"Missing case limb: line %d\0A\00", align 1, !dbg !39

; Function Attrs: noinline nounwind optnone ssp uwtable
define signext i8 @getlines(ptr noundef %0, i32 noundef %1) #0 !dbg !56 {
  %3 = alloca ptr, align 8
  %4 = alloca i32, align 4
  %5 = alloca ptr, align 8
  store ptr %0, ptr %3, align 8
  call void @llvm.dbg.declare(metadata ptr %3, metadata !62, metadata !DIExpression()), !dbg !63

!1186 = !DILocation(line: 498, column: 11, scope: !1181)
!1187 = !DILocation(line: 498, column: 9, scope: !1181)
!1188 = !DILocation(line: 499, column: 6, scope: !1181)
!1189 = !DILocation(line: 500, column: 11, scope: !1190)
!1190 = distinct !DILexicalBlock(scope: !1167, file: !2, line: 500, column: 10)
!1191 = !DILocation(line: 500, column: 13, scope: !1190)
!1192 = !DILocation(line: 500, column: 20, scope: !1190)
!1193 = !DILocation(line: 500, column: 24, scope: !1190)
!1194 = !DILocation(line: 500, column: 29, scope: !1190)
!1195 = !DILocation(line: 500, column: 26, scope: !1190)
!1196 = !DILocation(line: 500, column: 10, scope: !1167)
!1197 = !DILocation(line: 501, column: 9, scope: !1198)
!1198 = distinct !DILexicalBlock(scope: !1190, file: !2, line: 500, column: 33)
!1199 = !DILocation(line: 501, column: 13, scope: !1198)
!1200 = !DILocation(line: 501, column: 16, scope: !1198)
!1201 = !DILocation(line: 501, column: 3, scope: !1198)
!1202 = !DILocation(line: 502, column: 7, scope: !1198)
!1203 = !DILocation(line: 502, column: 9, scope: !1198)
!1204 = !DILocation(line: 502, column: 5, scope: !1198)
!1205 = !DILocation(line: 503, column: 6, scope: !1198)
!1206 = !DILocation(line: 504, column: 7, scope: !1190)
!1207 = !DILocation(line: 504, column: 5, scope: !1190)
!1208 = distinct !{!1208, !1162, !1209, !307}
!1209 = !DILocation(line: 505, column: 2, scope: !1145)
!1210 = !DILocation(line: 506, column: 1, scope: !1145)
!1211 = distinct !DISubprogram(name: "change", scope: !2, file: !2, line: 509, type: !1212, scopeLine: 511, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !61)
!1212 = !DISubroutineType(types: !1213)
!1213 = !{null, !59, !59}
!1214 = !DILocalVariable(name: "pat", arg: 1, scope: !1211, file: !2, line: 510, type: !59)
!1215 = !DILocation(line: 510, column: 7, scope: !1211)
!1216 = !DILocalVariable(name: "sub", arg: 2, scope: !1211, file: !2, line: 510, type: !59)
!1217 = !DILocation(line: 510, column: 13, scope: !1211)
!1218 = !DILocalVariable(name: "line", scope: !1211, file: !2, line: 512, type: !1219)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "string", file: !2, line: 38, baseType: !1220)
!1220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 800, elements: !1221)
!1221 = !{!1222}
!1222 = !DISubrange(count: 100)
!1223 = !DILocation(line: 512, column: 13, scope: !1211)
!1224 = !DILocalVariable(name: "result", scope: !1211, file: !2, line: 513, type: !46)
!1225 = !DILocation(line: 513, column: 10, scope: !1211)
!1226 = !DILocation(line: 515, column: 23, scope: !1211)
!1227 = !DILocation(line: 515, column: 14, scope: !1211)
!1228 = !DILocation(line: 515, column: 12, scope: !1211)
!1229 = !DILocation(line: 516, column: 5, scope: !1211)
!1230 = !DILocation(line: 516, column: 13, scope: !1211)
!1231 = !DILocation(line: 517, column: 10, scope: !1232)
!1232 = distinct !DILexicalBlock(scope: !1211, file: !2, line: 516, column: 22)
!1233 = !DILocation(line: 517, column: 16, scope: !1232)
!1234 = !DILocation(line: 517, column: 21, scope: !1232)
!1235 = !DILocation(line: 517, column: 2, scope: !1232)
!1236 = !DILocation(line: 518, column: 20, scope: !1232)
!1237 = !DILocation(line: 518, column: 11, scope: !1232)
!1238 = !DILocation(line: 518, column: 9, scope: !1232)
!1239 = distinct !{!1239, !1229, !1240, !307}
!1240 = !DILocation(line: 519, column: 5, scope: !1211)
!1241 = !DILocation(line: 520, column: 1, scope: !1211)
!1242 = distinct !DISubprogram(name: "main", scope: !2, file: !2, line: 522, type: !1243, scopeLine: 525, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !61)
!1243 = !DISubroutineType(types: !1244)
!1244 = !{!60, !60, !1245}
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!1246 = !DILocalVariable(name: "argc", arg: 1, scope: !1242, file: !2, line: 523, type: !60)
!1247 = !DILocation(line: 523, column: 5, scope: !1242)
!1248 = !DILocalVariable(name: "argv", arg: 2, scope: !1242, file: !2, line: 524, type: !1245)
!1249 = !DILocation(line: 524, column: 7, scope: !1242)
!1250 = !DILocalVariable(name: "pat", scope: !1242, file: !2, line: 526, type: !1219)
!1251 = !DILocation(line: 526, column: 12, scope: !1242)
!1252 = !DILocalVariable(name: "sub", scope: !1242, file: !2, line: 526, type: !1219)
!1253 = !DILocation(line: 526, column: 17, scope: !1242)
!1254 = !DILocalVariable(name: "result", scope: !1242, file: !2, line: 527, type: !46)
!1255 = !DILocation(line: 527, column: 10, scope: !1242)
!1256 = !DILocalVariable(name: "line", scope: !1242, file: !2, line: 529, type: !1257)
!1257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 1920, elements: !1258)
!1258 = !{!1259, !1260}
!1259 = !DISubrange(count: 12)
!1260 = !DISubrange(count: 20)
!1261 = !DILocation(line: 529, column: 10, scope: !1242)
!1262 = !DILocalVariable(name: "buffer", scope: !1242, file: !2, line: 530, type: !1263)
!1263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 3200, elements: !1264)
!1264 = !{!1260, !1260}
!1265 = !DILocation(line: 530, column: 10, scope: !1242)
!1266 = !DILocalVariable(name: "file", scope: !1242, file: !2, line: 532, type: !1267)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64)
!1268 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1269, line: 157, baseType: !1270)
!1269 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX12.sdk/usr/include/_stdio.h", directory: "")
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !1269, line: 126, size: 1216, elements: !1271)
!1271 = !{!1272, !1275, !1276, !1277, !1279, !1280, !1285, !1286, !1288, !1292, !1296, !1306, !1312, !1313, !1316, !1317, !1319, !1323, !1324, !1325}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !1270, file: !1269, line: 127, baseType: !1273, size: 64)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64)
!1274 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !1270, file: !1269, line: 128, baseType: !60, size: 32, offset: 64)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !1270, file: !1269, line: 129, baseType: !60, size: 32, offset: 96)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1270, file: !1269, line: 130, baseType: !1278, size: 16, offset: 128)
!1278 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !1270, file: !1269, line: 131, baseType: !1278, size: 16, offset: 144)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !1270, file: !1269, line: 132, baseType: !1281, size: 128, offset: 192)
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !1269, line: 92, size: 128, elements: !1282)
!1282 = !{!1283, !1284}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !1281, file: !1269, line: 93, baseType: !1273, size: 64)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !1281, file: !1269, line: 94, baseType: !60, size: 32, offset: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !1270, file: !1269, line: 133, baseType: !60, size: 32, offset: 320)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !1270, file: !1269, line: 136, baseType: !1287, size: 64, offset: 384)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !1270, file: !1269, line: 137, baseType: !1289, size: 64, offset: 448)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{!60, !1287}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !1270, file: !1269, line: 138, baseType: !1293, size: 64, offset: 512)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64)
!1294 = !DISubroutineType(types: !1295)
!1295 = !{!60, !1287, !59, !60}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !1270, file: !1269, line: 139, baseType: !1297, size: 64, offset: 576)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64)
!1298 = !DISubroutineType(types: !1299)
!1299 = !{!1300, !1287, !1300, !60}
!1300 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !1269, line: 81, baseType: !1301)
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !1302, line: 71, baseType: !1303)
!1302 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX12.sdk/usr/include/sys/_types.h", directory: "")
!1303 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !1304, line: 24, baseType: !1305)
!1304 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX12.sdk/usr/include/arm/_types.h", directory: "")
!1305 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !1270, file: !1269, line: 140, baseType: !1307, size: 64, offset: 640)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64)
!1308 = !DISubroutineType(types: !1309)
!1309 = !{!60, !1287, !1310, !60}
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64)
!1311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !1270, file: !1269, line: 143, baseType: !1281, size: 128, offset: 704)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !1270, file: !1269, line: 144, baseType: !1314, size: 64, offset: 832)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64)
!1315 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !1269, line: 98, flags: DIFlagFwdDecl)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !1270, file: !1269, line: 145, baseType: !60, size: 32, offset: 896)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !1270, file: !1269, line: 148, baseType: !1318, size: 24, offset: 928)
!1318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1274, size: 24, elements: !15)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !1270, file: !1269, line: 149, baseType: !1320, size: 8, offset: 952)
!1320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1274, size: 8, elements: !1321)
!1321 = !{!1322}
!1322 = !DISubrange(count: 1)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !1270, file: !1269, line: 152, baseType: !1281, size: 128, offset: 960)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !1270, file: !1269, line: 155, baseType: !60, size: 32, offset: 1088)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1270, file: !1269, line: 156, baseType: !1300, size: 64, offset: 1152)
!1326 = !DILocation(line: 532, column: 11, scope: !1242)
!1327 = !DILocation(line: 532, column: 24, scope: !1242)
!1328 = !DILocation(line: 532, column: 18, scope: !1242)
!1329 = !DILocation(line: 533, column: 9, scope: !1330)
!1330 = distinct !DILexicalBlock(scope: !1242, file: !2, line: 533, column: 8)
!1331 = !DILocation(line: 533, column: 8, scope: !1242)
!1332 = !DILocation(line: 534, column: 9, scope: !1333)
!1333 = distinct !DILexicalBlock(scope: !1330, file: !2, line: 533, column: 14)
!1334 = !DILocation(line: 535, column: 9, scope: !1333)
!1335 = !DILocalVariable(name: "i", scope: !1242, file: !2, line: 538, type: !60)
!1336 = !DILocation(line: 538, column: 9, scope: !1242)
!1337 = !DILocation(line: 539, column: 5, scope: !1242)
!1338 = !DILocation(line: 539, column: 17, scope: !1242)
!1339 = !DILocation(line: 539, column: 38, scope: !1242)
!1340 = !DILocation(line: 539, column: 11, scope: !1242)
!1341 = !DILocation(line: 540, column: 9, scope: !1342)
!1342 = distinct !DILexicalBlock(scope: !1242, file: !2, line: 539, column: 44)
!1343 = !DILocation(line: 541, column: 10, scope: !1342)
!1344 = distinct !{!1344, !1337, !1345, !307}
!1345 = !DILocation(line: 542, column: 5, scope: !1242)
!1346 = !DILocalVariable(name: "j", scope: !1347, file: !2, line: 544, type: !60)
!1347 = distinct !DILexicalBlock(scope: !1242, file: !2, line: 544, column: 5)
!1348 = !DILocation(line: 544, column: 14, scope: !1347)
!1349 = !DILocation(line: 544, column: 10, scope: !1347)
!1350 = !DILocation(line: 544, column: 18, scope: !1351)
!1351 = distinct !DILexicalBlock(scope: !1347, file: !2, line: 544, column: 5)
!1352 = !DILocation(line: 544, column: 20, scope: !1351)
!1353 = !DILocation(line: 544, column: 19, scope: !1351)
!1354 = !DILocation(line: 544, column: 5, scope: !1347)
!1355 = !DILocation(line: 545, column: 29, scope: !1356)
!1356 = distinct !DILexicalBlock(scope: !1351, file: !2, line: 544, column: 26)
!1357 = !DILocation(line: 545, column: 22, scope: !1356)
!1358 = !DILocation(line: 545, column: 9, scope: !1356)
!1359 = !DILocation(line: 545, column: 14, scope: !1356)
!1360 = !DILocation(line: 545, column: 15, scope: !1356)
!1361 = !DILocation(line: 545, column: 19, scope: !1356)
!1362 = !DILocation(line: 546, column: 5, scope: !1356)
!1363 = !DILocation(line: 544, column: 23, scope: !1351)
!1364 = !DILocation(line: 544, column: 5, scope: !1351)
!1365 = distinct !{!1365, !1354, !1366, !307}
!1366 = !DILocation(line: 546, column: 5, scope: !1347)
!1367 = !DILocalVariable(name: "i", scope: !1368, file: !2, line: 548, type: !60)
!1368 = distinct !DILexicalBlock(scope: !1242, file: !2, line: 548, column: 5)
!1369 = !DILocation(line: 548, column: 13, scope: !1368)
!1370 = !DILocation(line: 548, column: 9, scope: !1368)
!1371 = !DILocation(line: 548, column: 17, scope: !1372)
!1372 = distinct !DILexicalBlock(scope: !1368, file: !2, line: 548, column: 5)
!1373 = !DILocation(line: 548, column: 18, scope: !1372)
!1374 = !DILocation(line: 548, column: 5, scope: !1368)
!1375 = !DILocation(line: 549, column: 21, scope: !1376)
!1376 = distinct !DILexicalBlock(scope: !1372, file: !2, line: 548, column: 25)
!1377 = !DILocation(line: 549, column: 26, scope: !1376)
!1378 = !DILocation(line: 549, column: 27, scope: !1376)
!1379 = !DILocation(line: 549, column: 7, scope: !1376)
!1380 = !DILocation(line: 550, column: 5, scope: !1376)
!1381 = !DILocation(line: 548, column: 22, scope: !1372)
!1382 = !DILocation(line: 548, column: 5, scope: !1372)
!1383 = distinct !{!1383, !1374, !1384, !307}
!1384 = !DILocation(line: 550, column: 5, scope: !1368)
!1385 = !DILocation(line: 552, column: 10, scope: !1242)
!1386 = !DILocation(line: 554, column: 8, scope: !1387)
!1387 = distinct !DILexicalBlock(scope: !1242, file: !2, line: 554, column: 8)
!1388 = !DILocation(line: 554, column: 13, scope: !1387)
