; ModuleID = 'gif2png.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct.GIFelement = type { %struct.GIFelement*, i8, i8*, i64, i64, %struct.GIFimagestruct* }
%struct.GIFimagestruct = type { [256 x %struct.png_color_struct], [256 x i64], i32, i32, i32, i32, i32, i32 }
%struct.png_color_struct = type { i8, i8, i8 }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.anon = type { i32, i32, i32, i32 }
%struct.gif_scr = type { i32, i32, [256 x %struct.png_color_struct], i32, i32, i32, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "c_437_l1", scope: !2, file: !3, line: 26, type: !6, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !5, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "437_l1.c", directory: "/gif2png/gif2png")
!4 = !{}
!5 = !{!0}
!6 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8192, elements: !8)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!9}
!9 = !DISubrange(count: 256)
!10 = !DIGlobalVariableExpression(var: !11, expr: !DIExpression())
!11 = distinct !DIGlobalVariable(name: "first", scope: !12, file: !13, line: 26, type: !236, isLocal: false, isDefinition: true)
!12 = distinct !DICompileUnit(language: DW_LANG_C99, file: !13, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !14, globals: !204, splitDebugInlining: false, nameTableKind: None)
!13 = !DIFile(filename: "gif2png.c", directory: "/gif2png/gif2png")
!14 = !{!15, !16, !46, !183, !75, !200, !7, !202, !74, !203}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_infopp", file: !17, line: 820, baseType: !18)
!17 = !DIFile(filename: "/usr/local/include/png.h", directory: "")
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_info", file: !17, line: 816, baseType: !21)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_info_struct", file: !17, line: 555, size: 2944, elements: !22)
!22 = !{!23, !27, !28, !29, !34, !45, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !61, !63, !64, !65, !66, !82, !92, !101, !104, !113, !114, !116, !117, !118, !119, !120, !121, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !139, !140, !141, !142, !155, !156, !157, !158, !159, !160, !180, !181, !182, !184, !185, !186, !187, !190, !192, !193, !194, !195, !196, !197, !198, !199}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !21, file: !17, line: 558, baseType: !24, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_32", file: !25, line: 1122, baseType: !26)
!25 = !DIFile(filename: "/usr/local/include/pngconf.h", directory: "")
!26 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !21, file: !17, line: 559, baseType: !24, size: 32, offset: 32)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !21, file: !17, line: 560, baseType: !24, size: 32, offset: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !21, file: !17, line: 562, baseType: !30, size: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_size_t", file: !25, line: 1135, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !32, line: 46, baseType: !33)
!32 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stddef.h", directory: "")
!33 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !21, file: !17, line: 564, baseType: !35, size: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_colorp", file: !17, line: 380, baseType: !36)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color", file: !17, line: 379, baseType: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_struct", file: !17, line: 374, size: 24, elements: !39)
!39 = !{!40, !43, !44}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !38, file: !17, line: 376, baseType: !41, size: 8)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_byte", file: !25, line: 1130, baseType: !42)
!42 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !38, file: !17, line: 377, baseType: !41, size: 8, offset: 8)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !38, file: !17, line: 378, baseType: !41, size: 8, offset: 16)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "num_palette", scope: !21, file: !17, line: 566, baseType: !46, size: 16, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16", file: !25, line: 1128, baseType: !47)
!47 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "num_trans", scope: !21, file: !17, line: 568, baseType: !46, size: 16, offset: 272)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !21, file: !17, line: 570, baseType: !41, size: 8, offset: 288)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !21, file: !17, line: 572, baseType: !41, size: 8, offset: 296)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "compression_type", scope: !21, file: !17, line: 575, baseType: !41, size: 8, offset: 304)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "filter_type", scope: !21, file: !17, line: 577, baseType: !41, size: 8, offset: 312)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "interlace_type", scope: !21, file: !17, line: 579, baseType: !41, size: 8, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !21, file: !17, line: 583, baseType: !41, size: 8, offset: 328)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !21, file: !17, line: 585, baseType: !41, size: 8, offset: 336)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "spare_byte", scope: !21, file: !17, line: 586, baseType: !41, size: 8, offset: 344)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "signature", scope: !21, file: !17, line: 588, baseType: !58, size: 64, offset: 352)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 64, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 8)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !21, file: !17, line: 602, baseType: !62, size: 32, offset: 416)
!62 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "srgb_intent", scope: !21, file: !17, line: 609, baseType: !41, size: 8, offset: 448)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "num_text", scope: !21, file: !17, line: 622, baseType: !7, size: 32, offset: 480)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "max_text", scope: !21, file: !17, line: 623, baseType: !7, size: 32, offset: 512)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !21, file: !17, line: 624, baseType: !67, size: 64, offset: 576)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_textp", file: !17, line: 463, baseType: !68)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_text", file: !17, line: 462, baseType: !70)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_text_struct", file: !17, line: 444, size: 448, elements: !71)
!71 = !{!72, !73, !77, !78, !79, !80, !81}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !70, file: !17, line: 446, baseType: !7, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !70, file: !17, line: 451, baseType: !74, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_charp", file: !25, line: 1211, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "text", scope: !70, file: !17, line: 452, baseType: !74, size: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "text_length", scope: !70, file: !17, line: 454, baseType: !30, size: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "itxt_length", scope: !70, file: !17, line: 456, baseType: !30, size: 64, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "lang", scope: !70, file: !17, line: 457, baseType: !74, size: 64, offset: 320)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "lang_key", scope: !70, file: !17, line: 459, baseType: !74, size: 64, offset: 384)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "mod_time", scope: !21, file: !17, line: 631, baseType: !83, size: 64, offset: 640)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_time", file: !17, line: 491, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_time_struct", file: !17, line: 483, size: 64, elements: !85)
!85 = !{!86, !87, !88, !89, !90, !91}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "year", scope: !84, file: !17, line: 485, baseType: !46, size: 16)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "month", scope: !84, file: !17, line: 486, baseType: !41, size: 8, offset: 16)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "day", scope: !84, file: !17, line: 487, baseType: !41, size: 8, offset: 24)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "hour", scope: !84, file: !17, line: 488, baseType: !41, size: 8, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "minute", scope: !84, file: !17, line: 489, baseType: !41, size: 8, offset: 40)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "second", scope: !84, file: !17, line: 490, baseType: !41, size: 8, offset: 48)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bit", scope: !21, file: !17, line: 641, baseType: !93, size: 40, offset: 704)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color_8", file: !17, line: 401, baseType: !94)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_8_struct", file: !17, line: 394, size: 40, elements: !95)
!95 = !{!96, !97, !98, !99, !100}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !94, file: !17, line: 396, baseType: !41, size: 8)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !94, file: !17, line: 397, baseType: !41, size: 8, offset: 8)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !94, file: !17, line: 398, baseType: !41, size: 8, offset: 16)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !94, file: !17, line: 399, baseType: !41, size: 8, offset: 24)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !94, file: !17, line: 400, baseType: !41, size: 8, offset: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "trans_alpha", scope: !21, file: !17, line: 655, baseType: !102, size: 64, offset: 768)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_bytep", file: !25, line: 1205, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "trans_color", scope: !21, file: !17, line: 657, baseType: !105, size: 80, offset: 832)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color_16", file: !17, line: 390, baseType: !106)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_16_struct", file: !17, line: 383, size: 80, elements: !107)
!107 = !{!108, !109, !110, !111, !112}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !106, file: !17, line: 385, baseType: !41, size: 8)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !106, file: !17, line: 386, baseType: !46, size: 16, offset: 16)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !106, file: !17, line: 387, baseType: !46, size: 16, offset: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !106, file: !17, line: 388, baseType: !46, size: 16, offset: 48)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "gray", scope: !106, file: !17, line: 389, baseType: !46, size: 16, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !21, file: !17, line: 668, baseType: !105, size: 80, offset: 912)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "x_offset", scope: !21, file: !17, line: 677, baseType: !115, size: 32, offset: 992)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_int_32", file: !25, line: 1123, baseType: !7)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "y_offset", scope: !21, file: !17, line: 678, baseType: !115, size: 32, offset: 1024)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unit_type", scope: !21, file: !17, line: 679, baseType: !41, size: 8, offset: 1056)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "x_pixels_per_unit", scope: !21, file: !17, line: 687, baseType: !24, size: 32, offset: 1088)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "y_pixels_per_unit", scope: !21, file: !17, line: 688, baseType: !24, size: 32, offset: 1120)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "phys_unit_type", scope: !21, file: !17, line: 689, baseType: !41, size: 8, offset: 1152)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "hist", scope: !21, file: !17, line: 700, baseType: !122, size: 64, offset: 1216)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16p", file: !25, line: 1208, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "x_white", scope: !21, file: !17, line: 711, baseType: !62, size: 32, offset: 1280)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "y_white", scope: !21, file: !17, line: 712, baseType: !62, size: 32, offset: 1312)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "x_red", scope: !21, file: !17, line: 713, baseType: !62, size: 32, offset: 1344)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "y_red", scope: !21, file: !17, line: 714, baseType: !62, size: 32, offset: 1376)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "x_green", scope: !21, file: !17, line: 715, baseType: !62, size: 32, offset: 1408)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "y_green", scope: !21, file: !17, line: 716, baseType: !62, size: 32, offset: 1440)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "x_blue", scope: !21, file: !17, line: 717, baseType: !62, size: 32, offset: 1472)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "y_blue", scope: !21, file: !17, line: 718, baseType: !62, size: 32, offset: 1504)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_purpose", scope: !21, file: !17, line: 734, baseType: !74, size: 64, offset: 1536)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_X0", scope: !21, file: !17, line: 735, baseType: !115, size: 32, offset: 1600)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_X1", scope: !21, file: !17, line: 736, baseType: !115, size: 32, offset: 1632)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_units", scope: !21, file: !17, line: 737, baseType: !74, size: 64, offset: 1664)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_params", scope: !21, file: !17, line: 739, baseType: !137, size: 64, offset: 1728)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_charpp", file: !25, line: 1229, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_type", scope: !21, file: !17, line: 741, baseType: !41, size: 8, offset: 1792)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "pcal_nparams", scope: !21, file: !17, line: 743, baseType: !41, size: 8, offset: 1800)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "free_me", scope: !21, file: !17, line: 748, baseType: !24, size: 32, offset: 1824)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunks", scope: !21, file: !17, line: 754, baseType: !143, size: 64, offset: 1856)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_unknown_chunkp", file: !17, line: 512, baseType: !144)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_unknown_chunk", file: !17, line: 511, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_unknown_chunk_t", file: !17, line: 502, size: 256, elements: !147)
!147 = !{!148, !152, !153, !154}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !146, file: !17, line: 504, baseType: !149, size: 40)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 40, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 5)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !146, file: !17, line: 505, baseType: !103, size: 64, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !146, file: !17, line: 506, baseType: !30, size: 64, offset: 128)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !146, file: !17, line: 509, baseType: !41, size: 8, offset: 192)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunks_num", scope: !21, file: !17, line: 755, baseType: !30, size: 64, offset: 1920)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_name", scope: !21, file: !17, line: 760, baseType: !74, size: 64, offset: 1984)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_profile", scope: !21, file: !17, line: 761, baseType: !74, size: 64, offset: 2048)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_proflen", scope: !21, file: !17, line: 764, baseType: !24, size: 32, offset: 2112)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "iccp_compression", scope: !21, file: !17, line: 765, baseType: !41, size: 8, offset: 2144)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "splt_palettes", scope: !21, file: !17, line: 770, baseType: !161, size: 64, offset: 2176)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_tp", file: !17, line: 432, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_t", file: !17, line: 431, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_sPLT_struct", file: !17, line: 425, size: 256, elements: !165)
!165 = !{!166, !167, !168, !179}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !164, file: !17, line: 427, baseType: !74, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !164, file: !17, line: 428, baseType: !41, size: 8, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !164, file: !17, line: 429, baseType: !169, size: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_entryp", file: !17, line: 417, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_sPLT_entry", file: !17, line: 416, baseType: !172)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_sPLT_entry_struct", file: !17, line: 409, size: 80, elements: !173)
!173 = !{!174, !175, !176, !177, !178}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !172, file: !17, line: 411, baseType: !46, size: 16)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !172, file: !17, line: 412, baseType: !46, size: 16, offset: 16)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !172, file: !17, line: 413, baseType: !46, size: 16, offset: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "alpha", scope: !172, file: !17, line: 414, baseType: !46, size: 16, offset: 48)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !172, file: !17, line: 415, baseType: !46, size: 16, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "nentries", scope: !164, file: !17, line: 430, baseType: !115, size: 32, offset: 192)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "splt_palettes_num", scope: !21, file: !17, line: 771, baseType: !24, size: 32, offset: 2240)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "scal_unit", scope: !21, file: !17, line: 782, baseType: !41, size: 8, offset: 2272)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "scal_pixel_width", scope: !21, file: !17, line: 784, baseType: !183, size: 64, offset: 2304)
!183 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "scal_pixel_height", scope: !21, file: !17, line: 785, baseType: !183, size: 64, offset: 2368)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "scal_s_width", scope: !21, file: !17, line: 788, baseType: !74, size: 64, offset: 2432)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "scal_s_height", scope: !21, file: !17, line: 789, baseType: !74, size: 64, offset: 2496)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "row_pointers", scope: !21, file: !17, line: 797, baseType: !188, size: 64, offset: 2560)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_bytepp", file: !25, line: 1223, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "int_gamma", scope: !21, file: !17, line: 801, baseType: !191, size: 32, offset: 2624)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_fixed_point", file: !25, line: 1201, baseType: !115)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "int_x_white", scope: !21, file: !17, line: 806, baseType: !191, size: 32, offset: 2656)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "int_y_white", scope: !21, file: !17, line: 807, baseType: !191, size: 32, offset: 2688)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "int_x_red", scope: !21, file: !17, line: 808, baseType: !191, size: 32, offset: 2720)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "int_y_red", scope: !21, file: !17, line: 809, baseType: !191, size: 32, offset: 2752)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "int_x_green", scope: !21, file: !17, line: 810, baseType: !191, size: 32, offset: 2784)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "int_y_green", scope: !21, file: !17, line: 811, baseType: !191, size: 32, offset: 2816)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "int_x_blue", scope: !21, file: !17, line: 812, baseType: !191, size: 32, offset: 2848)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "int_y_blue", scope: !21, file: !17, line: 813, baseType: !191, size: 32, offset: 2880)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !201, line: 17, baseType: !42)
!201 = !DIFile(filename: "./gif2png.h", directory: "/gif2png/gif2png")
!202 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!204 = !{!10, !205, !207, !209, !211, !213, !215, !217, !219, !221, !223, !225, !227, !229, !231, !233, !259}
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "delete", scope: !12, file: !13, line: 28, type: !7, isLocal: false, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "optimize", scope: !12, file: !13, line: 29, type: !7, isLocal: false, isDefinition: true)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "histogram", scope: !12, file: !13, line: 30, type: !7, isLocal: false, isDefinition: true)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "interlaced", scope: !12, file: !13, line: 31, type: !7, isLocal: false, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "progress", scope: !12, file: !13, line: 32, type: !7, isLocal: false, isDefinition: true)
!215 = !DIGlobalVariableExpression(var: !216, expr: !DIExpression())
!216 = distinct !DIGlobalVariable(name: "verbose", scope: !12, file: !13, line: 33, type: !7, isLocal: false, isDefinition: true)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "recover", scope: !12, file: !13, line: 34, type: !7, isLocal: false, isDefinition: true)
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "webconvert", scope: !12, file: !13, line: 35, type: !7, isLocal: false, isDefinition: true)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "software_chunk", scope: !12, file: !13, line: 36, type: !7, isLocal: false, isDefinition: true)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "filtermode", scope: !12, file: !13, line: 37, type: !7, isLocal: false, isDefinition: true)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "matte", scope: !12, file: !13, line: 38, type: !7, isLocal: false, isDefinition: true)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "gamma_srgb", scope: !12, file: !13, line: 39, type: !7, isLocal: false, isDefinition: true)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "numgifs", scope: !12, file: !13, line: 41, type: !202, isLocal: false, isDefinition: true)
!231 = !DIGlobalVariableExpression(var: !232, expr: !DIExpression())
!232 = distinct !DIGlobalVariable(name: "numpngs", scope: !12, file: !13, line: 42, type: !202, isLocal: false, isDefinition: true)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "current", scope: !12, file: !13, line: 27, type: !235, isLocal: false, isDefinition: true)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GIFelement", file: !201, line: 32, size: 384, elements: !237)
!237 = !{!238, !239, !240, !242, !243, !244}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !236, file: !201, line: 33, baseType: !235, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "GIFtype", scope: !236, file: !201, line: 34, baseType: !76, size: 8, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !236, file: !201, line: 35, baseType: !241, size: 64, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "allocated_size", scope: !236, file: !201, line: 36, baseType: !202, size: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !236, file: !201, line: 37, baseType: !202, size: 64, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "imagestruct", scope: !236, file: !201, line: 39, baseType: !245, size: 64, offset: 320)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GIFimagestruct", file: !201, line: 21, size: 22720, elements: !247)
!247 = !{!248, !251, !253, !254, !255, !256, !257, !258}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "colors", scope: !246, file: !201, line: 22, baseType: !249, size: 6144)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 6144, elements: !8)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "GifColor", file: !201, line: 19, baseType: !37)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "color_count", scope: !246, file: !201, line: 23, baseType: !252, size: 16384, offset: 6144)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 16384, elements: !8)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "offset_x", scope: !246, file: !201, line: 24, baseType: !7, size: 32, offset: 22528)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "offset_y", scope: !246, file: !201, line: 25, baseType: !7, size: 32, offset: 22560)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !246, file: !201, line: 26, baseType: !7, size: 32, offset: 22592)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !246, file: !201, line: 27, baseType: !7, size: 32, offset: 22624)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "trans", scope: !246, file: !201, line: 28, baseType: !7, size: 32, offset: 22656)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "interlace", scope: !246, file: !201, line: 29, baseType: !7, size: 32, offset: 22688)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "matte_color", scope: !12, file: !13, line: 40, type: !250, isLocal: false, isDefinition: true)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "imagecount", scope: !263, file: !264, line: 43, type: !7, isLocal: false, isDefinition: true)
!263 = distinct !DICompileUnit(language: DW_LANG_C99, file: !264, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !265, globals: !266, splitDebugInlining: false, nameTableKind: None)
!264 = !DIFile(filename: "gifread.c", directory: "/gif2png/gif2png")
!265 = !{!75, !7, !203, !42, !202}
!266 = !{!267, !327, !347, !261, !355, !357, !363, !365, !367, !369, !371, !373, !375, !377, !379, !381, !383, !385, !387, !390, !395, !402, !404, !406, !412}
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "colors", scope: !269, file: !264, line: 134, type: !326, isLocal: true, isDefinition: true)
!269 = distinct !DISubprogram(name: "ReadGIF", scope: !264, file: !264, line: 68, type: !270, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !263, retainedNodes: !4)
!270 = !DISubroutineType(types: !271)
!271 = !{!7, !272}
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !274, line: 7, baseType: !275)
!274 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "")
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !276, line: 49, size: 1728, elements: !277)
!276 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!277 = !{!278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !293, !295, !296, !297, !300, !301, !303, !307, !310, !312, !315, !318, !319, !320, !321, !322}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !275, file: !276, line: 51, baseType: !7, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !275, file: !276, line: 54, baseType: !75, size: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !275, file: !276, line: 55, baseType: !75, size: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !275, file: !276, line: 56, baseType: !75, size: 64, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !275, file: !276, line: 57, baseType: !75, size: 64, offset: 256)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !275, file: !276, line: 58, baseType: !75, size: 64, offset: 320)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !275, file: !276, line: 59, baseType: !75, size: 64, offset: 384)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !275, file: !276, line: 60, baseType: !75, size: 64, offset: 448)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !275, file: !276, line: 61, baseType: !75, size: 64, offset: 512)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !275, file: !276, line: 64, baseType: !75, size: 64, offset: 576)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !275, file: !276, line: 65, baseType: !75, size: 64, offset: 640)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !275, file: !276, line: 66, baseType: !75, size: 64, offset: 704)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !275, file: !276, line: 68, baseType: !291, size: 64, offset: 768)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !276, line: 36, flags: DIFlagFwdDecl)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !275, file: !276, line: 70, baseType: !294, size: 64, offset: 832)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !275, file: !276, line: 72, baseType: !7, size: 32, offset: 896)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !275, file: !276, line: 73, baseType: !7, size: 32, offset: 928)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !275, file: !276, line: 74, baseType: !298, size: 64, offset: 960)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !299, line: 152, baseType: !202)
!299 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "")
!300 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !275, file: !276, line: 77, baseType: !47, size: 16, offset: 1024)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !275, file: !276, line: 78, baseType: !302, size: 8, offset: 1040)
!302 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !275, file: !276, line: 79, baseType: !304, size: 8, offset: 1048)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 8, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 1)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !275, file: !276, line: 81, baseType: !308, size: 64, offset: 1088)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !276, line: 43, baseType: null)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !275, file: !276, line: 89, baseType: !311, size: 64, offset: 1152)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !299, line: 153, baseType: !202)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !275, file: !276, line: 91, baseType: !313, size: 64, offset: 1216)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 64)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !276, line: 37, flags: DIFlagFwdDecl)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !275, file: !276, line: 92, baseType: !316, size: 64, offset: 1280)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !276, line: 38, flags: DIFlagFwdDecl)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !275, file: !276, line: 93, baseType: !294, size: 64, offset: 1344)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !275, file: !276, line: 94, baseType: !15, size: 64, offset: 1408)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !275, file: !276, line: 95, baseType: !31, size: 64, offset: 1472)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !275, file: !276, line: 96, baseType: !7, size: 32, offset: 1536)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !275, file: !276, line: 98, baseType: !323, size: 160, offset: 1568)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 160, elements: !324)
!324 = !{!325}
!325 = !DISubrange(count: 20)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 256, elements: !59)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "GifScreen", scope: !263, file: !264, line: 26, type: !329, isLocal: false, isDefinition: true)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gif_scr", file: !201, line: 42, size: 6368, elements: !330)
!330 = !{!331, !332, !333, !342, !343, !344, !345, !346}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "Width", scope: !329, file: !201, line: 43, baseType: !26, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "Height", scope: !329, file: !201, line: 44, baseType: !26, size: 32, offset: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "ColorMap", scope: !329, file: !201, line: 45, baseType: !334, size: 6144, offset: 64)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 6144, elements: !8)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "GifColor", file: !201, line: 19, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_color", file: !17, line: 379, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_color_struct", file: !17, line: 374, size: 24, elements: !338)
!338 = !{!339, !340, !341}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "red", scope: !337, file: !17, line: 376, baseType: !41, size: 8)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "green", scope: !337, file: !17, line: 377, baseType: !41, size: 8, offset: 8)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "blue", scope: !337, file: !17, line: 378, baseType: !41, size: 8, offset: 16)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "ColorMap_present", scope: !329, file: !201, line: 46, baseType: !26, size: 32, offset: 6208)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "BitPixel", scope: !329, file: !201, line: 47, baseType: !26, size: 32, offset: 6240)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ColorResolution", scope: !329, file: !201, line: 48, baseType: !26, size: 32, offset: 6272)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "Background", scope: !329, file: !201, line: 49, baseType: !7, size: 32, offset: 6304)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "AspectRatio", scope: !329, file: !201, line: 50, baseType: !26, size: 32, offset: 6336)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "Gif89", scope: !263, file: !264, line: 33, type: !349, isLocal: false, isDefinition: true)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !264, line: 28, size: 128, elements: !350)
!350 = !{!351, !352, !353, !354}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "transparent", scope: !349, file: !264, line: 29, baseType: !7, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "delayTime", scope: !349, file: !264, line: 30, baseType: !7, size: 32, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "inputFlag", scope: !349, file: !264, line: 31, baseType: !7, size: 32, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "disposal", scope: !349, file: !264, line: 32, baseType: !7, size: 32, offset: 96)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "recover_message", scope: !263, file: !264, line: 44, type: !7, isLocal: false, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "buf", scope: !359, file: !264, line: 259, type: !362, isLocal: true, isDefinition: true)
!359 = distinct !DISubprogram(name: "DoExtension", scope: !264, file: !264, line: 257, type: !360, scopeLine: 258, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !263, retainedNodes: !4)
!360 = !DISubroutineType(types: !361)
!361 = !{!7, !272, !7}
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 2048, elements: !8)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "ZeroDataBlock", scope: !263, file: !264, line: 388, type: !7, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "set_code_size", scope: !263, file: !264, line: 420, type: !7, isLocal: true, isDefinition: true)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "code_size", scope: !263, file: !264, line: 420, type: !7, isLocal: true, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "clear_code", scope: !263, file: !264, line: 422, type: !7, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "end_code", scope: !263, file: !264, line: 422, type: !7, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "max_code_size", scope: !263, file: !264, line: 421, type: !7, isLocal: true, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "max_code", scope: !263, file: !264, line: 421, type: !7, isLocal: true, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "lastbit", scope: !263, file: !264, line: 414, type: !7, isLocal: true, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "curbit", scope: !263, file: !264, line: 414, type: !7, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "last_byte", scope: !263, file: !264, line: 414, type: !7, isLocal: true, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "get_done", scope: !263, file: !264, line: 414, type: !7, isLocal: true, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "return_clear", scope: !263, file: !264, line: 415, type: !7, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "sp", scope: !263, file: !264, line: 419, type: !389, isLocal: true, isDefinition: true)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "stack", scope: !263, file: !264, line: 419, type: !392, isLocal: true, isDefinition: true)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 262144, elements: !393)
!393 = !{!394}
!394 = !DISubrange(count: 8192)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "table", scope: !397, file: !264, line: 506, type: !398, isLocal: true, isDefinition: true)
!397 = distinct !DISubprogram(name: "nextLWZ", scope: !264, file: !264, line: 504, type: !270, scopeLine: 505, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !263, retainedNodes: !4)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 262144, elements: !399)
!399 = !{!400, !401}
!400 = !DISubrange(count: 2)
!401 = !DISubrange(count: 4096)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "firstcode", scope: !397, file: !264, line: 507, type: !7, isLocal: true, isDefinition: true)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "oldcode", scope: !397, file: !264, line: 507, type: !7, isLocal: true, isDefinition: true)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "buf", scope: !408, file: !264, line: 444, type: !409, isLocal: true, isDefinition: true)
!408 = distinct !DISubprogram(name: "nextCode", scope: !264, file: !264, line: 442, type: !360, scopeLine: 443, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !263, retainedNodes: !4)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 2240, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 280)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "maskTbl", scope: !408, file: !264, line: 445, type: !414, isLocal: true, isDefinition: true)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 512, elements: !415)
!415 = !{!416}
!416 = !DISubrange(count: 16)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "version", scope: !419, file: !420, line: 18, type: !428, isLocal: false, isDefinition: true)
!419 = distinct !DICompileUnit(language: DW_LANG_C99, file: !420, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !421, splitDebugInlining: false, nameTableKind: None)
!420 = !DIFile(filename: "version.c", directory: "/gif2png/gif2png")
!421 = !{!417, !422}
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "compile_info", scope: !419, file: !420, line: 20, type: !424, isLocal: false, isDefinition: true)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 456, elements: !426)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!426 = !{!427}
!427 = !DISubrange(count: 57)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 112, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 14)
!431 = distinct !DICompileUnit(language: DW_LANG_C99, file: !432, producer: "clang version 10.0.0-4ubuntu1 ", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !433, splitDebugInlining: false, nameTableKind: None)
!432 = !DIFile(filename: "memory.c", directory: "/gif2png/gif2png")
!433 = !{!31, !15}
!434 = !{!"clang version 10.0.0-4ubuntu1 "}
!435 = !{i32 7, !"Dwarf Version", i32 4}
!436 = !{i32 2, !"Debug Info Version", i32 3}
!437 = !{i32 1, !"wchar_size", i32 4}
!438 = distinct !DISubprogram(name: "interlace_line", scope: !13, file: !13, line: 45, type: !439, scopeLine: 47, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !12, retainedNodes: !4)
!439 = !DISubroutineType(types: !440)
!440 = !{!7, !7, !7}
!441 = !DILocalVariable(name: "height", arg: 1, scope: !438, file: !13, line: 45, type: !7)
!442 = !DILocation(line: 45, column: 24, scope: !438)
!443 = !DILocalVariable(name: "line", arg: 2, scope: !438, file: !13, line: 45, type: !7)
!444 = !DILocation(line: 45, column: 36, scope: !438)
!445 = !DILocalVariable(name: "res", scope: !438, file: !13, line: 48, type: !7)
!446 = !DILocation(line: 48, column: 9, scope: !438)
!447 = !DILocation(line: 50, column: 10, scope: !448)
!448 = distinct !DILexicalBlock(scope: !438, file: !13, line: 50, column: 9)
!449 = !DILocation(line: 50, column: 15, scope: !448)
!450 = !DILocation(line: 50, column: 20, scope: !448)
!451 = !DILocation(line: 50, column: 9, scope: !438)
!452 = !DILocation(line: 51, column: 9, scope: !453)
!453 = distinct !DILexicalBlock(scope: !448, file: !13, line: 50, column: 26)
!454 = !DILocation(line: 51, column: 14, scope: !453)
!455 = !DILocation(line: 51, column: 2, scope: !453)
!456 = !DILocation(line: 53, column: 12, scope: !438)
!457 = !DILocation(line: 53, column: 18, scope: !438)
!458 = !DILocation(line: 53, column: 22, scope: !438)
!459 = !DILocation(line: 53, column: 9, scope: !438)
!460 = !DILocation(line: 54, column: 10, scope: !461)
!461 = distinct !DILexicalBlock(scope: !438, file: !13, line: 54, column: 9)
!462 = !DILocation(line: 54, column: 15, scope: !461)
!463 = !DILocation(line: 54, column: 20, scope: !461)
!464 = !DILocation(line: 54, column: 9, scope: !438)
!465 = !DILocation(line: 55, column: 9, scope: !466)
!466 = distinct !DILexicalBlock(scope: !461, file: !13, line: 54, column: 26)
!467 = !DILocation(line: 55, column: 15, scope: !466)
!468 = !DILocation(line: 55, column: 19, scope: !466)
!469 = !DILocation(line: 55, column: 23, scope: !466)
!470 = !DILocation(line: 55, column: 12, scope: !466)
!471 = !DILocation(line: 55, column: 2, scope: !466)
!472 = !DILocation(line: 57, column: 13, scope: !438)
!473 = !DILocation(line: 57, column: 19, scope: !438)
!474 = !DILocation(line: 57, column: 23, scope: !438)
!475 = !DILocation(line: 57, column: 9, scope: !438)
!476 = !DILocation(line: 58, column: 10, scope: !477)
!477 = distinct !DILexicalBlock(scope: !438, file: !13, line: 58, column: 9)
!478 = !DILocation(line: 58, column: 15, scope: !477)
!479 = !DILocation(line: 58, column: 20, scope: !477)
!480 = !DILocation(line: 58, column: 9, scope: !438)
!481 = !DILocation(line: 59, column: 9, scope: !482)
!482 = distinct !DILexicalBlock(scope: !477, file: !13, line: 58, column: 26)
!483 = !DILocation(line: 59, column: 17, scope: !482)
!484 = !DILocation(line: 59, column: 21, scope: !482)
!485 = !DILocation(line: 59, column: 25, scope: !482)
!486 = !DILocation(line: 59, column: 13, scope: !482)
!487 = !DILocation(line: 59, column: 2, scope: !482)
!488 = !DILocation(line: 61, column: 12, scope: !438)
!489 = !DILocation(line: 61, column: 20, scope: !438)
!490 = !DILocation(line: 61, column: 26, scope: !438)
!491 = !DILocation(line: 61, column: 30, scope: !438)
!492 = !DILocation(line: 61, column: 16, scope: !438)
!493 = !DILocation(line: 61, column: 40, scope: !438)
!494 = !DILocation(line: 61, column: 44, scope: !438)
!495 = !DILocation(line: 61, column: 48, scope: !438)
!496 = !DILocation(line: 61, column: 36, scope: !438)
!497 = !DILocation(line: 61, column: 5, scope: !438)
!498 = !DILocation(line: 62, column: 1, scope: !438)
!499 = distinct !DISubprogram(name: "inv_interlace_line", scope: !13, file: !13, line: 64, type: !439, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !12, retainedNodes: !4)
!500 = !DILocalVariable(name: "height", arg: 1, scope: !499, file: !13, line: 64, type: !7)
!501 = !DILocation(line: 64, column: 28, scope: !499)
!502 = !DILocalVariable(name: "line", arg: 2, scope: !499, file: !13, line: 64, type: !7)
!503 = !DILocation(line: 64, column: 40, scope: !499)
!504 = !DILocation(line: 67, column: 10, scope: !505)
!505 = distinct !DILexicalBlock(scope: !499, file: !13, line: 67, column: 9)
!506 = !DILocation(line: 67, column: 15, scope: !505)
!507 = !DILocation(line: 67, column: 21, scope: !505)
!508 = !DILocation(line: 67, column: 20, scope: !505)
!509 = !DILocation(line: 67, column: 9, scope: !499)
!510 = !DILocation(line: 68, column: 9, scope: !511)
!511 = distinct !DILexicalBlock(scope: !505, file: !13, line: 67, column: 29)
!512 = !DILocation(line: 68, column: 14, scope: !511)
!513 = !DILocation(line: 68, column: 2, scope: !511)
!514 = !DILocation(line: 70, column: 14, scope: !499)
!515 = !DILocation(line: 70, column: 20, scope: !499)
!516 = !DILocation(line: 70, column: 24, scope: !499)
!517 = !DILocation(line: 70, column: 10, scope: !499)
!518 = !DILocation(line: 71, column: 10, scope: !519)
!519 = distinct !DILexicalBlock(scope: !499, file: !13, line: 71, column: 9)
!520 = !DILocation(line: 71, column: 15, scope: !519)
!521 = !DILocation(line: 71, column: 21, scope: !519)
!522 = !DILocation(line: 71, column: 27, scope: !519)
!523 = !DILocation(line: 71, column: 25, scope: !519)
!524 = !DILocation(line: 71, column: 9, scope: !499)
!525 = !DILocation(line: 72, column: 10, scope: !526)
!526 = distinct !DILexicalBlock(scope: !519, file: !13, line: 71, column: 35)
!527 = !DILocation(line: 72, column: 15, scope: !526)
!528 = !DILocation(line: 72, column: 21, scope: !526)
!529 = !DILocation(line: 72, column: 2, scope: !526)
!530 = !DILocation(line: 74, column: 14, scope: !499)
!531 = !DILocation(line: 74, column: 20, scope: !499)
!532 = !DILocation(line: 74, column: 24, scope: !499)
!533 = !DILocation(line: 74, column: 10, scope: !499)
!534 = !DILocation(line: 75, column: 10, scope: !535)
!535 = distinct !DILexicalBlock(scope: !499, file: !13, line: 75, column: 9)
!536 = !DILocation(line: 75, column: 15, scope: !535)
!537 = !DILocation(line: 75, column: 21, scope: !535)
!538 = !DILocation(line: 75, column: 27, scope: !535)
!539 = !DILocation(line: 75, column: 25, scope: !535)
!540 = !DILocation(line: 75, column: 9, scope: !499)
!541 = !DILocation(line: 76, column: 10, scope: !542)
!542 = distinct !DILexicalBlock(scope: !535, file: !13, line: 75, column: 35)
!543 = !DILocation(line: 76, column: 15, scope: !542)
!544 = !DILocation(line: 76, column: 21, scope: !542)
!545 = !DILocation(line: 76, column: 2, scope: !542)
!546 = !DILocation(line: 78, column: 14, scope: !499)
!547 = !DILocation(line: 78, column: 21, scope: !499)
!548 = !DILocation(line: 78, column: 26, scope: !499)
!549 = !DILocation(line: 78, column: 10, scope: !499)
!550 = !DILocation(line: 79, column: 13, scope: !499)
!551 = !DILocation(line: 79, column: 18, scope: !499)
!552 = !DILocation(line: 79, column: 24, scope: !499)
!553 = !DILocation(line: 79, column: 5, scope: !499)
!554 = !DILocation(line: 80, column: 1, scope: !499)
!555 = distinct !DISubprogram(name: "is_gray", scope: !13, file: !13, line: 105, type: !556, scopeLine: 106, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !12, retainedNodes: !4)
!556 = !DISubroutineType(types: !557)
!557 = !{!7, !37}
!558 = !DILocalVariable(name: "c", arg: 1, scope: !555, file: !13, line: 105, type: !37)
!559 = !DILocation(line: 105, column: 23, scope: !555)
!560 = !DILocation(line: 110, column: 14, scope: !555)
!561 = !DILocation(line: 110, column: 12, scope: !555)
!562 = !DILocation(line: 110, column: 23, scope: !555)
!563 = !DILocation(line: 110, column: 21, scope: !555)
!564 = !DILocation(line: 110, column: 18, scope: !555)
!565 = !DILocation(line: 110, column: 29, scope: !555)
!566 = !DILocation(line: 110, column: 34, scope: !555)
!567 = !DILocation(line: 110, column: 32, scope: !555)
!568 = !DILocation(line: 110, column: 45, scope: !555)
!569 = !DILocation(line: 110, column: 43, scope: !555)
!570 = !DILocation(line: 110, column: 40, scope: !555)
!571 = !DILocation(line: 0, scope: !555)
!572 = !DILocation(line: 110, column: 5, scope: !555)
!573 = distinct !DISubprogram(name: "writefile", scope: !13, file: !13, line: 113, type: !574, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !12, retainedNodes: !4)
!574 = !DISubroutineType(types: !575)
!575 = !{!7, !235, !235, !576, !7}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !274, line: 7, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !276, line: 49, size: 1728, elements: !579)
!579 = !{!580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !578, file: !276, line: 51, baseType: !7, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !578, file: !276, line: 54, baseType: !75, size: 64, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !578, file: !276, line: 55, baseType: !75, size: 64, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !578, file: !276, line: 56, baseType: !75, size: 64, offset: 192)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !578, file: !276, line: 57, baseType: !75, size: 64, offset: 256)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !578, file: !276, line: 58, baseType: !75, size: 64, offset: 320)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !578, file: !276, line: 59, baseType: !75, size: 64, offset: 384)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !578, file: !276, line: 60, baseType: !75, size: 64, offset: 448)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !578, file: !276, line: 61, baseType: !75, size: 64, offset: 512)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !578, file: !276, line: 64, baseType: !75, size: 64, offset: 576)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !578, file: !276, line: 65, baseType: !75, size: 64, offset: 640)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !578, file: !276, line: 66, baseType: !75, size: 64, offset: 704)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !578, file: !276, line: 68, baseType: !291, size: 64, offset: 768)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !578, file: !276, line: 70, baseType: !594, size: 64, offset: 832)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !578, file: !276, line: 72, baseType: !7, size: 32, offset: 896)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !578, file: !276, line: 73, baseType: !7, size: 32, offset: 928)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !578, file: !276, line: 74, baseType: !298, size: 64, offset: 960)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !578, file: !276, line: 77, baseType: !47, size: 16, offset: 1024)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !578, file: !276, line: 78, baseType: !302, size: 8, offset: 1040)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !578, file: !276, line: 79, baseType: !304, size: 8, offset: 1048)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !578, file: !276, line: 81, baseType: !308, size: 64, offset: 1088)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !578, file: !276, line: 89, baseType: !311, size: 64, offset: 1152)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !578, file: !276, line: 91, baseType: !313, size: 64, offset: 1216)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !578, file: !276, line: 92, baseType: !316, size: 64, offset: 1280)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !578, file: !276, line: 93, baseType: !594, size: 64, offset: 1344)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !578, file: !276, line: 94, baseType: !15, size: 64, offset: 1408)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !578, file: !276, line: 95, baseType: !31, size: 64, offset: 1472)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !578, file: !276, line: 96, baseType: !7, size: 32, offset: 1536)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !578, file: !276, line: 98, baseType: !323, size: 160, offset: 1568)
!610 = !DILocalVariable(name: "s", arg: 1, scope: !573, file: !13, line: 113, type: !235)
!611 = !DILocation(line: 113, column: 34, scope: !573)
!612 = !DILocalVariable(name: "e", arg: 2, scope: !573, file: !13, line: 113, type: !235)
!613 = !DILocation(line: 113, column: 55, scope: !573)
!614 = !DILocalVariable(name: "fp", arg: 3, scope: !573, file: !13, line: 113, type: !576)
!615 = !DILocation(line: 113, column: 64, scope: !573)
!616 = !DILocalVariable(name: "lastimg", arg: 4, scope: !573, file: !13, line: 113, type: !7)
!617 = !DILocation(line: 113, column: 72, scope: !573)
!618 = !DILocalVariable(name: "i", scope: !573, file: !13, line: 115, type: !7)
!619 = !DILocation(line: 115, column: 9, scope: !573)
!620 = !DILocalVariable(name: "img", scope: !573, file: !13, line: 116, type: !245)
!621 = !DILocation(line: 116, column: 28, scope: !573)
!622 = !DILocation(line: 116, column: 34, scope: !573)
!623 = !DILocation(line: 116, column: 37, scope: !573)
!624 = !DILocalVariable(name: "count", scope: !573, file: !13, line: 117, type: !625)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!626 = !DILocation(line: 117, column: 20, scope: !573)
!627 = !DILocation(line: 117, column: 28, scope: !573)
!628 = !DILocation(line: 117, column: 33, scope: !573)
!629 = !DILocalVariable(name: "colors", scope: !573, file: !13, line: 118, type: !630)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!631 = !DILocation(line: 118, column: 15, scope: !573)
!632 = !DILocation(line: 118, column: 24, scope: !573)
!633 = !DILocation(line: 118, column: 29, scope: !573)
!634 = !DILocalVariable(name: "colors_used", scope: !573, file: !13, line: 119, type: !7)
!635 = !DILocation(line: 119, column: 9, scope: !573)
!636 = !DILocalVariable(name: "remap", scope: !573, file: !13, line: 120, type: !637)
!637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 2048, elements: !8)
!638 = !DILocation(line: 120, column: 10, scope: !573)
!639 = !DILocalVariable(name: "low_prec", scope: !573, file: !13, line: 121, type: !7)
!640 = !DILocation(line: 121, column: 9, scope: !573)
!641 = !DILocalVariable(name: "png_ptr", scope: !573, file: !13, line: 122, type: !642)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_struct", file: !17, line: 938, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_struct_def", file: !17, line: 1014, size: 9920, elements: !645)
!645 = !{!646, !667, !673, !681, !682, !684, !689, !690, !691, !707, !708, !709, !710, !711, !712, !713, !714, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !801, !802, !803, !804, !805, !806, !807, !808, !809, !812, !813, !814, !815, !816, !817, !818, !823, !825, !831, !836, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !880, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "jmpbuf", scope: !644, file: !17, line: 1017, baseType: !647, size: 2496)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "jmp_buf", file: !648, line: 45, baseType: !649)
!648 = !DIFile(filename: "/usr/include/setjmp.h", directory: "")
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !650, size: 2496, elements: !305)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__jmp_buf_tag", file: !648, line: 33, size: 2496, elements: !651)
!651 = !{!652, !659, !660}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "__jmpbuf", scope: !650, file: !648, line: 39, baseType: !653, size: 1408)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "__jmp_buf", file: !654, line: 30, baseType: !655)
!654 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/setjmp.h", directory: "")
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !656, size: 1408, elements: !657)
!656 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!657 = !{!658}
!658 = !DISubrange(count: 22)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "__mask_was_saved", scope: !650, file: !648, line: 40, baseType: !7, size: 32, offset: 1408)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "__saved_mask", scope: !650, file: !648, line: 41, baseType: !661, size: 1024, offset: 1472)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !662, line: 8, baseType: !663)
!662 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/__sigset_t.h", directory: "")
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !662, line: 5, size: 1024, elements: !664)
!664 = !{!665}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !663, file: !662, line: 7, baseType: !666, size: 1024)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 1024, elements: !415)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "longjmp_fn", scope: !644, file: !17, line: 1018, baseType: !668, size: 64, offset: 2496)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_longjmp_ptr", file: !17, line: 976, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = !DISubroutineType(types: !671)
!671 = !{null, !672, !7}
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "error_fn", scope: !644, file: !17, line: 1021, baseType: !674, size: 64, offset: 2560)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_error_ptr", file: !17, line: 942, baseType: !675)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DISubroutineType(types: !677)
!677 = !{null, !678, !679}
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_structp", file: !17, line: 939, baseType: !642)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_const_charp", file: !25, line: 1210, baseType: !680)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "warning_fn", scope: !644, file: !17, line: 1023, baseType: !674, size: 64, offset: 2624)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "error_ptr", scope: !644, file: !17, line: 1025, baseType: !683, size: 64, offset: 2688)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_voidp", file: !25, line: 1204, baseType: !15)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "write_data_fn", scope: !644, file: !17, line: 1027, baseType: !685, size: 64, offset: 2752)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_rw_ptr", file: !17, line: 943, baseType: !686)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DISubroutineType(types: !688)
!688 = !{null, !678, !102, !30}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "read_data_fn", scope: !644, file: !17, line: 1029, baseType: !685, size: 64, offset: 2816)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "io_ptr", scope: !644, file: !17, line: 1031, baseType: !683, size: 64, offset: 2880)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "read_user_transform_fn", scope: !644, file: !17, line: 1035, baseType: !692, size: 64, offset: 2944)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_user_transform_ptr", file: !17, line: 960, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DISubroutineType(types: !695)
!695 = !{null, !678, !696, !102}
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_row_infop", file: !17, line: 929, baseType: !697)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_row_info", file: !17, line: 927, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "png_row_info_struct", file: !17, line: 919, size: 192, elements: !700)
!700 = !{!701, !702, !703, !704, !705, !706}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !699, file: !17, line: 921, baseType: !24, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !699, file: !17, line: 922, baseType: !30, size: 64, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !699, file: !17, line: 923, baseType: !41, size: 8, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !699, file: !17, line: 924, baseType: !41, size: 8, offset: 136)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !699, file: !17, line: 925, baseType: !41, size: 8, offset: 144)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !699, file: !17, line: 926, baseType: !41, size: 8, offset: 152)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "write_user_transform_fn", scope: !644, file: !17, line: 1040, baseType: !692, size: 64, offset: 3008)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_ptr", scope: !644, file: !17, line: 1048, baseType: !683, size: 64, offset: 3072)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_depth", scope: !644, file: !17, line: 1050, baseType: !41, size: 8, offset: 3136)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "user_transform_channels", scope: !644, file: !17, line: 1052, baseType: !41, size: 8, offset: 3144)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !644, file: !17, line: 1057, baseType: !24, size: 32, offset: 3168)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !644, file: !17, line: 1059, baseType: !24, size: 32, offset: 3200)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "transformations", scope: !644, file: !17, line: 1061, baseType: !24, size: 32, offset: 3232)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "zstream", scope: !644, file: !17, line: 1064, baseType: !715, size: 896, offset: 3264)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "z_stream", file: !716, line: 106, baseType: !717)
!716 = !DIFile(filename: "/usr/include/zlib.h", directory: "")
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_stream_s", file: !716, line: 86, size: 896, elements: !718)
!718 = !{!719, !724, !726, !728, !729, !730, !731, !732, !735, !741, !746, !747, !748, !749}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "next_in", scope: !717, file: !716, line: 87, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "Bytef", file: !722, line: 400, baseType: !723)
!722 = !DIFile(filename: "/usr/include/zconf.h", directory: "")
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "Byte", file: !722, line: 391, baseType: !42)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "avail_in", scope: !717, file: !716, line: 88, baseType: !725, size: 32, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "uInt", file: !722, line: 393, baseType: !26)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "total_in", scope: !717, file: !716, line: 89, baseType: !727, size: 64, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "uLong", file: !722, line: 394, baseType: !33)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "next_out", scope: !717, file: !716, line: 91, baseType: !720, size: 64, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "avail_out", scope: !717, file: !716, line: 92, baseType: !725, size: 32, offset: 256)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "total_out", scope: !717, file: !716, line: 93, baseType: !727, size: 64, offset: 320)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !717, file: !716, line: 95, baseType: !75, size: 64, offset: 384)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !717, file: !716, line: 96, baseType: !733, size: 64, offset: 448)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DICompositeType(tag: DW_TAG_structure_type, name: "internal_state", file: !716, line: 84, flags: DIFlagFwdDecl)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "zalloc", scope: !717, file: !716, line: 98, baseType: !736, size: 64, offset: 512)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "alloc_func", file: !716, line: 81, baseType: !737)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{!740, !740, !725, !725}
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "voidpf", file: !722, line: 409, baseType: !15)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "zfree", scope: !717, file: !716, line: 99, baseType: !742, size: 64, offset: 576)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "free_func", file: !716, line: 82, baseType: !743)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DISubroutineType(types: !745)
!745 = !{null, !740, !740}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "opaque", scope: !717, file: !716, line: 100, baseType: !740, size: 64, offset: 640)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "data_type", scope: !717, file: !716, line: 102, baseType: !7, size: 32, offset: 704)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "adler", scope: !717, file: !716, line: 104, baseType: !727, size: 64, offset: 768)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !717, file: !716, line: 105, baseType: !727, size: 64, offset: 832)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf", scope: !644, file: !17, line: 1066, baseType: !102, size: 64, offset: 4160)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "zbuf_size", scope: !644, file: !17, line: 1067, baseType: !30, size: 64, offset: 4224)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_level", scope: !644, file: !17, line: 1068, baseType: !7, size: 32, offset: 4288)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_method", scope: !644, file: !17, line: 1069, baseType: !7, size: 32, offset: 4320)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_window_bits", scope: !644, file: !17, line: 1070, baseType: !7, size: 32, offset: 4352)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_mem_level", scope: !644, file: !17, line: 1072, baseType: !7, size: 32, offset: 4384)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "zlib_strategy", scope: !644, file: !17, line: 1074, baseType: !7, size: 32, offset: 4416)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !644, file: !17, line: 1077, baseType: !24, size: 32, offset: 4448)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "height", scope: !644, file: !17, line: 1078, baseType: !24, size: 32, offset: 4480)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "num_rows", scope: !644, file: !17, line: 1079, baseType: !24, size: 32, offset: 4512)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "usr_width", scope: !644, file: !17, line: 1080, baseType: !24, size: 32, offset: 4544)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "rowbytes", scope: !644, file: !17, line: 1081, baseType: !30, size: 64, offset: 4608)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_malloc_max", scope: !644, file: !17, line: 1092, baseType: !763, size: 64, offset: 4672)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_alloc_size_t", file: !25, line: 1526, baseType: !30)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "iwidth", scope: !644, file: !17, line: 1094, baseType: !24, size: 32, offset: 4736)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "row_number", scope: !644, file: !17, line: 1096, baseType: !24, size: 32, offset: 4768)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "prev_row", scope: !644, file: !17, line: 1097, baseType: !102, size: 64, offset: 4800)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "row_buf", scope: !644, file: !17, line: 1099, baseType: !102, size: 64, offset: 4864)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "sub_row", scope: !644, file: !17, line: 1101, baseType: !102, size: 64, offset: 4928)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "up_row", scope: !644, file: !17, line: 1103, baseType: !102, size: 64, offset: 4992)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "avg_row", scope: !644, file: !17, line: 1105, baseType: !102, size: 64, offset: 5056)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "paeth_row", scope: !644, file: !17, line: 1107, baseType: !102, size: 64, offset: 5120)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "row_info", scope: !644, file: !17, line: 1109, baseType: !698, size: 192, offset: 5184)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "idat_size", scope: !644, file: !17, line: 1112, baseType: !24, size: 32, offset: 5376)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "crc", scope: !644, file: !17, line: 1113, baseType: !24, size: 32, offset: 5408)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "palette", scope: !644, file: !17, line: 1114, baseType: !35, size: 64, offset: 5440)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "num_palette", scope: !644, file: !17, line: 1115, baseType: !46, size: 16, offset: 5504)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "num_trans", scope: !644, file: !17, line: 1117, baseType: !46, size: 16, offset: 5520)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_name", scope: !644, file: !17, line: 1118, baseType: !149, size: 40, offset: 5536)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "compression", scope: !644, file: !17, line: 1120, baseType: !41, size: 8, offset: 5576)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !644, file: !17, line: 1122, baseType: !41, size: 8, offset: 5584)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "interlaced", scope: !644, file: !17, line: 1123, baseType: !41, size: 8, offset: 5592)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !644, file: !17, line: 1125, baseType: !41, size: 8, offset: 5600)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "do_filter", scope: !644, file: !17, line: 1126, baseType: !41, size: 8, offset: 5608)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "color_type", scope: !644, file: !17, line: 1128, baseType: !41, size: 8, offset: 5616)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "bit_depth", scope: !644, file: !17, line: 1129, baseType: !41, size: 8, offset: 5624)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "usr_bit_depth", scope: !644, file: !17, line: 1130, baseType: !41, size: 8, offset: 5632)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "pixel_depth", scope: !644, file: !17, line: 1131, baseType: !41, size: 8, offset: 5640)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "channels", scope: !644, file: !17, line: 1132, baseType: !41, size: 8, offset: 5648)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "usr_channels", scope: !644, file: !17, line: 1133, baseType: !41, size: 8, offset: 5656)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bytes", scope: !644, file: !17, line: 1134, baseType: !41, size: 8, offset: 5664)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "filler", scope: !644, file: !17, line: 1138, baseType: !46, size: 16, offset: 5680)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "background_gamma_type", scope: !644, file: !17, line: 1143, baseType: !41, size: 8, offset: 5696)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "background_gamma", scope: !644, file: !17, line: 1145, baseType: !62, size: 32, offset: 5728)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "background", scope: !644, file: !17, line: 1147, baseType: !105, size: 80, offset: 5760)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "background_1", scope: !644, file: !17, line: 1150, baseType: !105, size: 80, offset: 5840)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "output_flush_fn", scope: !644, file: !17, line: 1156, baseType: !797, size: 64, offset: 5952)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_flush_ptr", file: !17, line: 944, baseType: !798)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DISubroutineType(types: !800)
!800 = !{null, !678}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "flush_dist", scope: !644, file: !17, line: 1158, baseType: !24, size: 32, offset: 6016)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "flush_rows", scope: !644, file: !17, line: 1160, baseType: !24, size: 32, offset: 6048)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_shift", scope: !644, file: !17, line: 1165, baseType: !7, size: 32, offset: 6080)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "gamma", scope: !644, file: !17, line: 1168, baseType: !62, size: 32, offset: 6112)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "screen_gamma", scope: !644, file: !17, line: 1169, baseType: !62, size: 32, offset: 6144)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_table", scope: !644, file: !17, line: 1175, baseType: !102, size: 64, offset: 6208)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_from_1", scope: !644, file: !17, line: 1177, baseType: !102, size: 64, offset: 6272)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_to_1", scope: !644, file: !17, line: 1178, baseType: !102, size: 64, offset: 6336)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_table", scope: !644, file: !17, line: 1179, baseType: !810, size: 64, offset: 6400)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_uint_16pp", file: !25, line: 1226, baseType: !811)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_from_1", scope: !644, file: !17, line: 1181, baseType: !810, size: 64, offset: 6464)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "gamma_16_to_1", scope: !644, file: !17, line: 1183, baseType: !810, size: 64, offset: 6528)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "sig_bit", scope: !644, file: !17, line: 1187, baseType: !93, size: 40, offset: 6592)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "shift", scope: !644, file: !17, line: 1192, baseType: !93, size: 40, offset: 6632)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "trans_alpha", scope: !644, file: !17, line: 1198, baseType: !102, size: 64, offset: 6720)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "trans_color", scope: !644, file: !17, line: 1200, baseType: !105, size: 80, offset: 6784)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "read_row_fn", scope: !644, file: !17, line: 1204, baseType: !819, size: 64, offset: 6912)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_read_status_ptr", file: !17, line: 945, baseType: !820)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DISubroutineType(types: !822)
!822 = !{null, !678, !24, !7}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "write_row_fn", scope: !644, file: !17, line: 1206, baseType: !824, size: 64, offset: 6976)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_write_status_ptr", file: !17, line: 947, baseType: !820)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "info_fn", scope: !644, file: !17, line: 1209, baseType: !826, size: 64, offset: 7040)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_info_ptr", file: !17, line: 951, baseType: !827)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 64)
!828 = !DISubroutineType(types: !829)
!829 = !{null, !678, !830}
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_infop", file: !17, line: 818, baseType: !19)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "row_fn", scope: !644, file: !17, line: 1211, baseType: !832, size: 64, offset: 7104)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_row_ptr", file: !17, line: 954, baseType: !833)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DISubroutineType(types: !835)
!835 = !{null, !678, !102, !24, !7}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "end_fn", scope: !644, file: !17, line: 1213, baseType: !837, size: 64, offset: 7168)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_progressive_end_ptr", file: !17, line: 953, baseType: !827)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_ptr", scope: !644, file: !17, line: 1215, baseType: !102, size: 64, offset: 7232)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer", scope: !644, file: !17, line: 1217, baseType: !102, size: 64, offset: 7296)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer_ptr", scope: !644, file: !17, line: 1219, baseType: !102, size: 64, offset: 7360)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer", scope: !644, file: !17, line: 1221, baseType: !102, size: 64, offset: 7424)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "push_length", scope: !644, file: !17, line: 1223, baseType: !24, size: 32, offset: 7488)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "skip_length", scope: !644, file: !17, line: 1225, baseType: !24, size: 32, offset: 7520)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_size", scope: !644, file: !17, line: 1227, baseType: !30, size: 64, offset: 7552)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "save_buffer_max", scope: !644, file: !17, line: 1229, baseType: !30, size: 64, offset: 7616)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_size", scope: !644, file: !17, line: 1231, baseType: !30, size: 64, offset: 7680)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "current_buffer_size", scope: !644, file: !17, line: 1233, baseType: !30, size: 64, offset: 7744)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "process_mode", scope: !644, file: !17, line: 1235, baseType: !7, size: 32, offset: 7808)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "cur_palette", scope: !644, file: !17, line: 1237, baseType: !7, size: 32, offset: 7840)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "current_text_size", scope: !644, file: !17, line: 1241, baseType: !30, size: 64, offset: 7872)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "current_text_left", scope: !644, file: !17, line: 1243, baseType: !30, size: 64, offset: 7936)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "current_text", scope: !644, file: !17, line: 1245, baseType: !74, size: 64, offset: 8000)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "current_text_ptr", scope: !644, file: !17, line: 1247, baseType: !74, size: 64, offset: 8064)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "palette_lookup", scope: !644, file: !17, line: 1263, baseType: !102, size: 64, offset: 8128)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_index", scope: !644, file: !17, line: 1264, baseType: !102, size: 64, offset: 8192)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "hist", scope: !644, file: !17, line: 1269, baseType: !122, size: 64, offset: 8256)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "time_buffer", scope: !644, file: !17, line: 1273, baseType: !74, size: 64, offset: 8320)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "free_me", scope: !644, file: !17, line: 1278, baseType: !24, size: 32, offset: 8384)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_ptr", scope: !644, file: !17, line: 1282, baseType: !683, size: 64, offset: 8448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "read_user_chunk_fn", scope: !644, file: !17, line: 1283, baseType: !861, size: 64, offset: 8512)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_user_chunk_ptr", file: !17, line: 965, baseType: !862)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 64)
!863 = !DISubroutineType(types: !864)
!864 = !{!7, !678, !143}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "num_chunk_list", scope: !644, file: !17, line: 1288, baseType: !7, size: 32, offset: 8576)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_list", scope: !644, file: !17, line: 1289, baseType: !102, size: 64, offset: 8640)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_status", scope: !644, file: !17, line: 1294, baseType: !41, size: 8, offset: 8704)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_red_coeff", scope: !644, file: !17, line: 1296, baseType: !46, size: 16, offset: 8720)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_green_coeff", scope: !644, file: !17, line: 1297, baseType: !46, size: 16, offset: 8736)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "rgb_to_gray_blue_coeff", scope: !644, file: !17, line: 1298, baseType: !46, size: 16, offset: 8752)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "mng_features_permitted", scope: !644, file: !17, line: 1306, baseType: !24, size: 32, offset: 8768)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "int_gamma", scope: !644, file: !17, line: 1311, baseType: !191, size: 32, offset: 8800)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "filter_type", scope: !644, file: !17, line: 1316, baseType: !41, size: 8, offset: 8832)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "mem_ptr", scope: !644, file: !17, line: 1323, baseType: !683, size: 64, offset: 8896)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_fn", scope: !644, file: !17, line: 1325, baseType: !876, size: 64, offset: 8960)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_malloc_ptr", file: !17, line: 1004, baseType: !877)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{!683, !678, !763}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "free_fn", scope: !644, file: !17, line: 1327, baseType: !881, size: 64, offset: 9024)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "png_free_ptr", file: !17, line: 1005, baseType: !882)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{null, !678, !683}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "big_row_buf", scope: !644, file: !17, line: 1332, baseType: !102, size: 64, offset: 9088)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "quantize_sort", scope: !644, file: !17, line: 1337, baseType: !102, size: 64, offset: 9152)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "index_to_palette", scope: !644, file: !17, line: 1338, baseType: !102, size: 64, offset: 9216)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "palette_to_index", scope: !644, file: !17, line: 1341, baseType: !102, size: 64, offset: 9280)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "compression_type", scope: !644, file: !17, line: 1347, baseType: !41, size: 8, offset: 9344)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "user_width_max", scope: !644, file: !17, line: 1350, baseType: !24, size: 32, offset: 9376)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "user_height_max", scope: !644, file: !17, line: 1351, baseType: !24, size: 32, offset: 9408)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "user_chunk_cache_max", scope: !644, file: !17, line: 1355, baseType: !24, size: 32, offset: 9440)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "unknown_chunk", scope: !644, file: !17, line: 1361, baseType: !145, size: 256, offset: 9472)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "old_big_row_buf_size", scope: !644, file: !17, line: 1365, baseType: !24, size: 32, offset: 9728)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "old_prev_row_size", scope: !644, file: !17, line: 1366, baseType: !24, size: 32, offset: 9760)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "chunkdata", scope: !644, file: !17, line: 1369, baseType: !74, size: 64, offset: 9792)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "io_state", scope: !644, file: !17, line: 1373, baseType: !24, size: 32, offset: 9856)
!898 = !DILocation(line: 122, column: 17, scope: !573)
!899 = !DILocation(line: 122, column: 27, scope: !573)
!900 = !DILocalVariable(name: "info_ptr", scope: !573, file: !13, line: 123, type: !19)
!901 = !DILocation(line: 123, column: 15, scope: !573)
!902 = !DILocation(line: 123, column: 26, scope: !573)
!903 = !DILocalVariable(name: "p", scope: !573, file: !13, line: 124, type: !7)
!904 = !DILocation(line: 124, column: 9, scope: !573)
!905 = !DILocalVariable(name: "gray_bitdepth", scope: !573, file: !13, line: 125, type: !7)
!906 = !DILocation(line: 125, column: 9, scope: !573)
!907 = !DILocalVariable(name: "pal_rgb", scope: !573, file: !13, line: 126, type: !908)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 6144, elements: !8)
!909 = !DILocation(line: 126, column: 15, scope: !573)
!910 = !DILocalVariable(name: "pltep", scope: !573, file: !13, line: 126, type: !36)
!911 = !DILocation(line: 126, column: 36, scope: !573)
!912 = !DILocalVariable(name: "pal_trans", scope: !573, file: !13, line: 127, type: !913)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 2048, elements: !8)
!914 = !DILocation(line: 127, column: 14, scope: !573)
!915 = !DILocalVariable(name: "color16trans", scope: !573, file: !13, line: 128, type: !105)
!916 = !DILocation(line: 128, column: 18, scope: !573)
!917 = !DILocalVariable(name: "color16back", scope: !573, file: !13, line: 128, type: !105)
!918 = !DILocation(line: 128, column: 32, scope: !573)
!919 = !DILocalVariable(name: "buffer", scope: !573, file: !13, line: 129, type: !920)
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 192, elements: !921)
!921 = !{!922}
!922 = !DISubrange(count: 24)
!923 = !DILocation(line: 129, column: 10, scope: !573)
!924 = !DILocalVariable(name: "j", scope: !573, file: !13, line: 130, type: !7)
!925 = !DILocation(line: 130, column: 9, scope: !573)
!926 = !DILocalVariable(name: "histogr", scope: !573, file: !13, line: 131, type: !927)
!927 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 4096, elements: !8)
!928 = !DILocation(line: 131, column: 17, scope: !573)
!929 = !DILocalVariable(name: "hist_maxvalue", scope: !573, file: !13, line: 132, type: !33)
!930 = !DILocation(line: 132, column: 19, scope: !573)
!931 = !DILocalVariable(name: "passcount", scope: !573, file: !13, line: 133, type: !7)
!932 = !DILocation(line: 133, column: 9, scope: !573)
!933 = !DILocalVariable(name: "errtype", scope: !573, file: !13, line: 134, type: !7)
!934 = !DILocation(line: 134, column: 9, scope: !573)
!935 = !DILocalVariable(name: "errorcount", scope: !573, file: !13, line: 134, type: !7)
!936 = !DILocation(line: 134, column: 18, scope: !573)
!937 = !DILocalVariable(name: "software", scope: !573, file: !13, line: 135, type: !69)
!938 = !DILocation(line: 135, column: 14, scope: !573)
!939 = !DILocalVariable(name: "comment", scope: !573, file: !13, line: 136, type: !69)
!940 = !DILocation(line: 136, column: 14, scope: !573)
!941 = !DILocalVariable(name: "gray", scope: !573, file: !13, line: 140, type: !942)
!942 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!943 = !DILocation(line: 140, column: 18, scope: !573)
!944 = !DILocalVariable(name: "last_color", scope: !573, file: !13, line: 141, type: !942)
!945 = !DILocation(line: 141, column: 18, scope: !573)
!946 = !DILocalVariable(name: "remapping", scope: !573, file: !13, line: 142, type: !942)
!947 = !DILocation(line: 142, column: 18, scope: !573)
!948 = !DILocalVariable(name: "bitdepth", scope: !573, file: !13, line: 143, type: !942)
!949 = !DILocation(line: 143, column: 18, scope: !573)
!950 = !DILocation(line: 146, column: 9, scope: !951)
!951 = distinct !DILexicalBlock(scope: !573, file: !13, line: 146, column: 9)
!952 = !DILocation(line: 146, column: 14, scope: !951)
!953 = !DILocation(line: 146, column: 20, scope: !951)
!954 = !DILocation(line: 146, column: 26, scope: !951)
!955 = !DILocation(line: 146, column: 30, scope: !951)
!956 = !DILocation(line: 146, column: 36, scope: !951)
!957 = !DILocation(line: 146, column: 41, scope: !951)
!958 = !DILocation(line: 146, column: 9, scope: !573)
!959 = !DILocation(line: 147, column: 2, scope: !951)
!960 = !DILocation(line: 147, column: 7, scope: !951)
!961 = !DILocation(line: 147, column: 13, scope: !951)
!962 = !DILocation(line: 149, column: 9, scope: !963)
!963 = distinct !DILexicalBlock(scope: !573, file: !13, line: 149, column: 9)
!964 = !DILocation(line: 149, column: 9, scope: !573)
!965 = !DILocation(line: 151, column: 9, scope: !966)
!966 = distinct !DILexicalBlock(scope: !967, file: !13, line: 151, column: 2)
!967 = distinct !DILexicalBlock(scope: !963, file: !13, line: 149, column: 19)
!968 = !DILocation(line: 151, column: 7, scope: !966)
!969 = !DILocation(line: 151, column: 14, scope: !970)
!970 = distinct !DILexicalBlock(scope: !966, file: !13, line: 151, column: 2)
!971 = !DILocation(line: 151, column: 16, scope: !970)
!972 = !DILocation(line: 151, column: 2, scope: !966)
!973 = !DILocation(line: 152, column: 10, scope: !974)
!974 = distinct !DILexicalBlock(scope: !970, file: !13, line: 152, column: 9)
!975 = !DILocation(line: 152, column: 16, scope: !974)
!976 = !DILocation(line: 152, column: 9, scope: !970)
!977 = !DILocation(line: 153, column: 37, scope: !974)
!978 = !DILocation(line: 153, column: 44, scope: !974)
!979 = !DILocation(line: 153, column: 47, scope: !974)
!980 = !DILocation(line: 153, column: 52, scope: !974)
!981 = !DILocation(line: 153, column: 19, scope: !974)
!982 = !DILocation(line: 153, column: 26, scope: !974)
!983 = !DILocation(line: 153, column: 29, scope: !974)
!984 = !DILocation(line: 153, column: 35, scope: !974)
!985 = !DILocation(line: 153, column: 3, scope: !974)
!986 = !DILocation(line: 153, column: 10, scope: !974)
!987 = !DILocation(line: 153, column: 13, scope: !974)
!988 = !DILocation(line: 153, column: 17, scope: !974)
!989 = !DILocation(line: 152, column: 17, scope: !974)
!990 = !DILocation(line: 151, column: 30, scope: !970)
!991 = !DILocation(line: 151, column: 2, scope: !970)
!992 = distinct !{!992, !972, !993}
!993 = !DILocation(line: 153, column: 54, scope: !966)
!994 = !DILocation(line: 160, column: 5, scope: !967)
!995 = !DILocation(line: 160, column: 17, scope: !996)
!996 = distinct !DILexicalBlock(scope: !963, file: !13, line: 160, column: 16)
!997 = !DILocation(line: 160, column: 16, scope: !963)
!998 = !DILocalVariable(name: "unused", scope: !999, file: !13, line: 162, type: !7)
!999 = distinct !DILexicalBlock(scope: !996, file: !13, line: 160, column: 26)
!1000 = !DILocation(line: 162, column: 6, scope: !999)
!1001 = !DILocation(line: 164, column: 9, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !999, file: !13, line: 164, column: 2)
!1003 = !DILocation(line: 164, column: 7, scope: !1002)
!1004 = !DILocation(line: 164, column: 14, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !1002, file: !13, line: 164, column: 2)
!1006 = !DILocation(line: 164, column: 16, scope: !1005)
!1007 = !DILocation(line: 164, column: 2, scope: !1002)
!1008 = !DILocation(line: 165, column: 11, scope: !1009)
!1009 = distinct !DILexicalBlock(scope: !1005, file: !13, line: 165, column: 10)
!1010 = !DILocation(line: 165, column: 17, scope: !1009)
!1011 = !DILocation(line: 165, column: 10, scope: !1005)
!1012 = !DILocation(line: 166, column: 9, scope: !1009)
!1013 = !DILocation(line: 166, column: 3, scope: !1009)
!1014 = !DILocation(line: 165, column: 18, scope: !1009)
!1015 = !DILocation(line: 164, column: 30, scope: !1005)
!1016 = !DILocation(line: 164, column: 2, scope: !1005)
!1017 = distinct !{!1017, !1007, !1018}
!1018 = !DILocation(line: 166, column: 9, scope: !1002)
!1019 = !DILocation(line: 168, column: 6, scope: !1020)
