; ModuleID = 'tcas_fuzz.c'
source_filename = "tcas_fuzz.c"
target datalayout = "e-m:o-i64:64-i128:128-n32:64-S128"
target triple = "arm64-apple-macosx12.0.0"

@Positive_RA_Alt_Thresh = global [4 x i32] zeroinitializer, align 4, !dbg !0
@Alt_Layer_Value = global i32 0, align 4, !dbg !42
@Climb_Inhibit = global i32 0, align 4, !dbg !52
@Up_Separation = global i32 0, align 4, !dbg !44
@Down_Separation = global i32 0, align 4, !dbg !46
@Cur_Vertical_Sep = global i32 0, align 4, !dbg !28
@Own_Tracked_Alt = global i32 0, align 4, !dbg !36
@Other_Tracked_Alt = global i32 0, align 4, !dbg !40
@High_Confidence = global i32 0, align 4, !dbg !31
@Own_Tracked_Alt_Rate = global i32 0, align 4, !dbg !38
@Other_Capability = global i32 0, align 4, !dbg !50
@Two_of_Three_Reports_Valid = global i32 0, align 4, !dbg !34
@Other_RAC = global i32 0, align 4, !dbg !48
@__stderrp = external global ptr, align 8
@.str = private unnamed_addr constant [31 x i8] c"Error: No filepath specified!\0A\00", align 1, !dbg !7
@.str.1 = private unnamed_addr constant [3 x i8] c"rb\00", align 1, !dbg !13
@.str.2 = private unnamed_addr constant [35 x i8] c"Error: Could not open input file!\0A\00", align 1, !dbg !18
@__stdoutp = external global ptr, align 8
@.str.3 = private unnamed_addr constant [4 x i8] c"%d\0A\00", align 1, !dbg !23

; Function Attrs: noinline nounwind optnone ssp uwtable
define void @initialize() #0 !dbg !62 {
  store i32 400, ptr @Positive_RA_Alt_Thresh, align 4, !dbg !66

!175 = !DILocalVariable(name: "tcas_equipped", scope: !172, file: !3, line: 117, type: !33)
!176 = !DILocation(line: 117, column: 19, scope: !172)
!177 = !DILocalVariable(name: "intent_not_known", scope: !172, file: !3, line: 117, type: !33)
!178 = !DILocation(line: 117, column: 34, scope: !172)
!179 = !DILocalVariable(name: "need_upward_RA", scope: !172, file: !3, line: 118, type: !33)
!180 = !DILocation(line: 118, column: 10, scope: !172)
!181 = !DILocalVariable(name: "need_downward_RA", scope: !172, file: !3, line: 118, type: !33)
!182 = !DILocation(line: 118, column: 26, scope: !172)
!183 = !DILocalVariable(name: "alt_sep", scope: !172, file: !3, line: 119, type: !30)
!184 = !DILocation(line: 119, column: 9, scope: !172)
!185 = !DILocation(line: 121, column: 15, scope: !172)
!186 = !DILocation(line: 121, column: 31, scope: !172)
!187 = !DILocation(line: 121, column: 35, scope: !172)
!188 = !DILocation(line: 121, column: 56, scope: !172)
!189 = !DILocation(line: 121, column: 65, scope: !172)
!190 = !DILocation(line: 121, column: 69, scope: !172)
!191 = !DILocation(line: 121, column: 86, scope: !172)
!192 = !DILocation(line: 0, scope: !172)
!193 = !DILocation(line: 121, column: 13, scope: !172)
!194 = !DILocation(line: 122, column: 21, scope: !172)
!195 = !DILocation(line: 122, column: 38, scope: !172)
!196 = !DILocation(line: 122, column: 19, scope: !172)
!197 = !DILocation(line: 123, column: 24, scope: !172)
!198 = !DILocation(line: 123, column: 51, scope: !172)
!199 = !DILocation(line: 123, column: 54, scope: !172)
!200 = !DILocation(line: 123, column: 64, scope: !172)
!201 = !DILocation(line: 123, column: 22, scope: !172)
!202 = !DILocation(line: 125, column: 13, scope: !172)
!203 = !DILocation(line: 127, column: 9, scope: !204)
!204 = distinct !DILexicalBlock(scope: !172, file: !3, line: 127, column: 9)
!205 = !DILocation(line: 127, column: 17, scope: !204)
!206 = !DILocation(line: 127, column: 22, scope: !204)
!207 = !DILocation(line: 127, column: 36, scope: !204)
!208 = !DILocation(line: 127, column: 39, scope: !204)
!209 = !DILocation(line: 127, column: 57, scope: !204)
!210 = !DILocation(line: 127, column: 61, scope: !204)
!211 = !DILocation(line: 127, column: 9, scope: !172)
!212 = !DILocation(line: 129, column: 26, scope: !213)
!213 = distinct !DILexicalBlock(scope: !204, file: !3, line: 128, column: 5)
!214 = !DILocation(line: 129, column: 54, scope: !213)
!215 = !DILocation(line: 129, column: 57, scope: !213)
!216 = !DILocation(line: 0, scope: !213)
!217 = !DILocation(line: 129, column: 24, scope: !213)
!218 = !DILocation(line: 130, column: 28, scope: !213)
!219 = !DILocation(line: 130, column: 58, scope: !213)
!220 = !DILocation(line: 130, column: 61, scope: !213)
!221 = !DILocation(line: 130, column: 26, scope: !213)
!222 = !DILocation(line: 131, column: 13, scope: !223)
!223 = distinct !DILexicalBlock(scope: !213, file: !3, line: 131, column: 13)
!224 = !DILocation(line: 131, column: 28, scope: !223)
!225 = !DILocation(line: 131, column: 31, scope: !223)
!226 = !DILocation(line: 131, column: 13, scope: !213)
!227 = !DILocation(line: 135, column: 21, scope: !223)
!228 = !DILocation(line: 135, column: 13, scope: !223)
!229 = !DILocation(line: 136, column: 18, scope: !230)
!230 = distinct !DILexicalBlock(scope: !223, file: !3, line: 136, column: 18)
!231 = !DILocation(line: 136, column: 18, scope: !223)
!232 = !DILocation(line: 137, column: 21, scope: !230)
!233 = !DILocation(line: 137, column: 13, scope: !230)
!234 = !DILocation(line: 138, column: 18, scope: !235)
!235 = distinct !DILexicalBlock(scope: !230, file: !3, line: 138, column: 18)
!236 = !DILocation(line: 138, column: 18, scope: !230)
!237 = !DILocation(line: 139, column: 21, scope: !235)
!238 = !DILocation(line: 139, column: 13, scope: !235)
!239 = !DILocation(line: 141, column: 21, scope: !235)
!240 = !DILocation(line: 142, column: 5, scope: !213)
!241 = !DILocation(line: 144, column: 12, scope: !172)
!242 = !DILocation(line: 144, column: 5, scope: !172)
!243 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 147, type: !244, scopeLine: 149, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !65)
!244 = !DISubroutineType(types: !245)
!245 = !{!30, !30, !246}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!248 = !DILocalVariable(name: "argc", arg: 1, scope: !243, file: !3, line: 147, type: !30)
!249 = !DILocation(line: 147, column: 22, scope: !243)
!250 = !DILocalVariable(name: "argv", arg: 2, scope: !243, file: !3, line: 148, type: !246)
!251 = !DILocation(line: 148, column: 7, scope: !243)
!252 = !DILocation(line: 151, column: 9, scope: !253)
!253 = distinct !DILexicalBlock(scope: !243, file: !3, line: 151, column: 9)
!254 = !DILocation(line: 151, column: 14, scope: !253)
!255 = !DILocation(line: 151, column: 9, scope: !243)
!256 = !DILocation(line: 153, column: 17, scope: !257)
!257 = distinct !DILexicalBlock(scope: !253, file: !3, line: 152, column: 5)
!258 = !DILocation(line: 153, column: 9, scope: !257)
!259 = !DILocation(line: 154, column: 9, scope: !257)
!260 = !DILocalVariable(name: "file", scope: !243, file: !3, line: 157, type: !261)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !263, line: 157, baseType: !264)
!263 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX12.sdk/usr/include/_stdio.h", directory: "")
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !263, line: 126, size: 1216, elements: !265)
!265 = !{!266, !269, !270, !271, !273, !274, !279, !280, !281, !285, !289, !299, !305, !306, !309, !310, !312, !316, !317, !318}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !264, file: !263, line: 127, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !264, file: !263, line: 128, baseType: !30, size: 32, offset: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !264, file: !263, line: 129, baseType: !30, size: 32, offset: 96)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !264, file: !263, line: 130, baseType: !272, size: 16, offset: 128)
!272 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !264, file: !263, line: 131, baseType: !272, size: 16, offset: 144)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !264, file: !263, line: 132, baseType: !275, size: 128, offset: 192)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !263, line: 92, size: 128, elements: !276)
!276 = !{!277, !278}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !275, file: !263, line: 93, baseType: !267, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !275, file: !263, line: 94, baseType: !30, size: 32, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !264, file: !263, line: 133, baseType: !30, size: 32, offset: 320)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !264, file: !263, line: 136, baseType: !5, size: 64, offset: 384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !264, file: !263, line: 137, baseType: !282, size: 64, offset: 448)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DISubroutineType(types: !284)
!284 = !{!30, !5}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !264, file: !263, line: 138, baseType: !286, size: 64, offset: 512)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{!30, !5, !247, !30}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !264, file: !263, line: 139, baseType: !290, size: 64, offset: 576)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!291 = !DISubroutineType(types: !292)
!292 = !{!293, !5, !293, !30}
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !263, line: 81, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !295, line: 71, baseType: !296)
!295 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX12.sdk/usr/include/sys/_types.h", directory: "")
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !297, line: 24, baseType: !298)
!297 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX12.sdk/usr/include/arm/_types.h", directory: "")
!298 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !264, file: !263, line: 140, baseType: !300, size: 64, offset: 640)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!30, !5, !303, !30}
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !264, file: !263, line: 143, baseType: !275, size: 128, offset: 704)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !264, file: !263, line: 144, baseType: !307, size: 64, offset: 832)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !263, line: 98, flags: DIFlagFwdDecl)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !264, file: !263, line: 145, baseType: !30, size: 32, offset: 896)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !264, file: !263, line: 148, baseType: !311, size: 24, offset: 928)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 24, elements: !16)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !264, file: !263, line: 149, baseType: !313, size: 8, offset: 952)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 8, elements: !314)
!314 = !{!315}
!315 = !DISubrange(count: 1)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !264, file: !263, line: 152, baseType: !275, size: 128, offset: 960)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !264, file: !263, line: 155, baseType: !30, size: 32, offset: 1088)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !264, file: !263, line: 156, baseType: !293, size: 64, offset: 1152)
!319 = !DILocation(line: 157, column: 11, scope: !243)
!320 = !DILocation(line: 157, column: 24, scope: !243)
!321 = !DILocation(line: 157, column: 18, scope: !243)
!322 = !DILocation(line: 159, column: 9, scope: !323)
!323 = distinct !DILexicalBlock(scope: !243, file: !3, line: 159, column: 9)
!324 = !DILocation(line: 159, column: 14, scope: !323)
!325 = !DILocation(line: 159, column: 9, scope: !243)
!326 = !DILocation(line: 160, column: 17, scope: !327)
!327 = distinct !DILexicalBlock(scope: !323, file: !3, line: 159, column: 23)
!328 = !DILocation(line: 160, column: 9, scope: !327)
!329 = !DILocation(line: 161, column: 9, scope: !327)
!330 = !DILocalVariable(name: "buffer", scope: !243, file: !3, line: 164, type: !331)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 192, elements: !333)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !297, line: 19, baseType: !268)
!333 = !{!334}
!334 = !DISubrange(count: 24)
!335 = !DILocation(line: 164, column: 15, scope: !243)
!336 = !DILocation(line: 166, column: 11, scope: !243)
!337 = !DILocation(line: 166, column: 26, scope: !243)
!338 = !DILocation(line: 166, column: 5, scope: !243)
!339 = !DILocation(line: 168, column: 12, scope: !243)
!340 = !DILocation(line: 168, column: 5, scope: !243)
!341 = !DILocalVariable(name: "inputs", scope: !243, file: !3, line: 170, type: !342)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 192, elements: !344)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !297, line: 20, baseType: !272)
!344 = !{!345}
!345 = !DISubrange(count: 12)
!346 = !DILocation(line: 170, column: 15, scope: !243)
!347 = !DILocalVariable(name: "i", scope: !348, file: !3, line: 172, type: !30)
!348 = distinct !DILexicalBlock(scope: !243, file: !3, line: 172, column: 5)
!349 = !DILocation(line: 172, column: 14, scope: !348)
!350 = !DILocalVariable(name: "j", scope: !348, file: !3, line: 172, type: !30)
!351 = !DILocation(line: 172, column: 21, scope: !348)
!352 = !DILocation(line: 172, column: 10, scope: !348)
!353 = !DILocation(line: 172, column: 28, scope: !354)
!354 = distinct !DILexicalBlock(scope: !348, file: !3, line: 172, column: 5)
!355 = !DILocation(line: 172, column: 30, scope: !354)
!356 = !DILocation(line: 172, column: 5, scope: !348)
!357 = !DILocation(line: 174, column: 29, scope: !358)
!358 = distinct !DILexicalBlock(scope: !354, file: !3, line: 172, column: 47)
!359 = !DILocation(line: 174, column: 22, scope: !358)
!360 = !DILocation(line: 174, column: 32, scope: !358)
!361 = !DILocation(line: 174, column: 47, scope: !358)
!362 = !DILocation(line: 174, column: 48, scope: !358)
!363 = !DILocation(line: 174, column: 40, scope: !358)
!364 = !DILocation(line: 174, column: 38, scope: !358)
!365 = !DILocation(line: 174, column: 21, scope: !358)
!366 = !DILocation(line: 174, column: 16, scope: !358)
!367 = !DILocation(line: 174, column: 9, scope: !358)
!368 = !DILocation(line: 174, column: 19, scope: !358)
!369 = !DILocation(line: 175, column: 5, scope: !358)
!370 = !DILocation(line: 172, column: 37, scope: !354)
!371 = !DILocation(line: 172, column: 42, scope: !354)
!372 = !DILocation(line: 172, column: 5, scope: !354)
!373 = distinct !{!373, !356, !374, !375}
!374 = !DILocation(line: 175, column: 5, scope: !348)
!375 = !{!"llvm.loop.mustprogress"}
!376 = !DILocation(line: 178, column: 5, scope: !243)
!377 = !DILocation(line: 179, column: 5, scope: !243)
!378 = !DILocation(line: 181, column: 24, scope: !243)
!379 = !DILocation(line: 181, column: 22, scope: !243)
!380 = !DILocation(line: 182, column: 23, scope: !243)
!381 = !DILocation(line: 182, column: 21, scope: !243)
!382 = !DILocation(line: 183, column: 34, scope: !243)
!383 = !DILocation(line: 183, column: 32, scope: !243)
!384 = !DILocation(line: 184, column: 23, scope: !243)
